
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章 · Linux大作业</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="liuyi">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.html" />
    
    
    <link rel="prev" href="readme.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;1&#x7AE0;-&#x8840;&#x8109;&#x91CD;&#x751F;">&#x7B2C;1&#x7AE0; &#x8840;&#x8109;&#x91CD;&#x751F;</h1>
<p>&#x5915;&#x9633;&#x897F;&#x4E0B;&#xFF0C;&#x971E;&#x5149;&#x6F2B;&#x5929;&#x3002;</p>
<p>  &#x98CE;&#x706B;&#x57CE;&#x5916;&#xFF0C;&#x7FE0;&#x4E91;&#x5CF0;&#x4E0A;&#xFF0C;&#x6709;&#x4E00;&#x5F20;&#x77F3;&#x684C;&#xFF0C;&#x684C;&#x65C1;&#xFF0C;&#x6709;&#x77F3;&#x51F3;&#xFF0C;&#x4E00;&#x5BF9;&#x5C11;&#x5E74;&#x7537;&#x5973;&#x76F8;&#x4E92;&#x4F9D;&#x504E;&#x3002;</p>
<p>  &#x5C11;&#x5E74;&#x8EAB;&#x6750;&#x504F;&#x7626;&#xFF0C;&#x8138;&#x8272;&#x7565;&#x663E;&#x82CD;&#x767D;&#xFF0C;&#x9762;&#x5E9E;&#x6E05;&#x79C0;&#x3002;</p>
<p>  &#x5C11;&#x5973;&#x4E00;&#x5E2D;&#x96EA;&#x767D;&#x957F;&#x88D9;&#xFF0C;&#x808C;&#x80A4;&#x5982;&#x7389;&#xFF0C;&#x5BB9;&#x8C8C;&#x7EDD;&#x7F8E;&#x3002;</p>
<p>  &#x5C11;&#x5973;&#x8111;&#x888B;&#x9760;&#x5728;&#x5C11;&#x5E74;&#x7684;&#x80A9;&#x8180;&#x4E0A;&#xFF0C;&#x5728;&#x5915;&#x9633;&#x7684;&#x7167;&#x5C04;&#x4E0B;&#xFF0C;&#x5B9B;&#x5982;&#x4E00;&#x5BF9;&#x795E;&#x4ED9;&#x7737;&#x4FA3;&#x3002;</p>
<p>  &#x201C;&#x7476;&#x513F;&#xFF0C;&#x771F;&#x5E0C;&#x671B;&#x80FD;&#x4E00;&#x8F88;&#x5B50;&#x5982;&#x6B64;&#xFF01;&#x201D;&#x5C11;&#x5E74;&#x8138;&#x4E0A;&#x6EE1;&#x662F;&#x5E78;&#x798F;&#x7684;&#x7B11;&#x5BB9;&#xFF0C;&#x8F7B;&#x8F7B;&#x8BF4;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x54E5;&#x54E5;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x662F;&#x8BF4;&#x8FC7;&#x8981;&#x4E00;&#x751F;&#x4E00;&#x4E16;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x5C11;&#x5973;&#x8138;&#x4E0A;&#x9732;&#x51FA;&#x5E78;&#x798F;&#x7684;&#x7B11;&#x5BB9;&#x3002;</p>
<p>  &#x5C11;&#x5E74;&#x540D;&#x4E3A;&#x9646;&#x9E23;&#xFF0C;&#x5C11;&#x5973;&#x540D;&#x4E3A;&#x9646;&#x7476;&#x3002;</p>
<p>  &#x770B;&#x7740;&#x9646;&#x7476;&#x8138;&#x4E0A;&#x7684;&#x7B11;&#x5BB9;&#xFF0C;&#x9646;&#x9E23;&#x773C;&#x795E;&#x66F4;&#x662F;&#x6E29;&#x67D4;&#xFF0C;&#x63E1;&#x4F4F;&#x9646;&#x7476;&#x67D4;&#x5F31;&#x65E0;&#x9AA8;&#x7684;&#x7389;&#x624B;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x7476;&#x513F;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x7B4B;&#x8109;&#x5835;&#x585E;&#xFF0C;&#x4E0D;&#x80FD;&#x51DD;&#x7EC3;&#x771F;&#x6C14;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x6211;&#x80FD;&#x89C9;&#x9192;&#x8840;&#x8109;&#xFF0C;&#x5230;&#x65F6;&#x957F;&#x8001;&#x9662;&#x5C31;&#x4F1A;&#x8D2D;&#x4E70;&#x7075;&#x836F;&#xFF0C;&#x4E3A;&#x6211;&#x758F;&#x901A;&#x7ECF;&#x8109;&#xFF0C;&#x90A3;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x4FEE;&#x70BC;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6B66;&#x9053;&#x5F3A;&#x8005;&#xFF0C;&#x5B88;&#x62A4;&#x4F60;&#x4E00;&#x751F;&#x4E00;&#x4E16;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x8C22;&#x8C22;&#x9E23;&#x54E5;&#x54E5;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x7476;&#x773C;&#x4E2D;&#x9732;&#x51FA;&#x611F;&#x52A8;&#x4E4B;&#x8272;&#xFF0C;&#x53C8;&#x9053;&#xFF1A;&#x201C;&#x9E23;&#x54E5;&#x54E5;&#xFF0C;&#x66FE;&#x7ECF;&#x771F;&#x7684;&#x6709;&#x6D4B;&#x8109;&#x8005;&#x6D4B;&#x8FC7;&#xFF0C;&#x4F60;&#x9057;&#x4F20;&#x4E86;&#x4F60;&#x7236;&#x4EB2;&#x7684;&#x8840;&#x8109;&#x5417;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x662F;&#x554A;&#xFF0C;&#x7476;&#x513F;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;&#x6765;&#x4F60;&#x7684;&#x7537;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x8005;&#x3002;&#x201D;&#x9646;&#x9E23;&#x8138;&#x4E0A;&#x9732;&#x51FA;&#x81EA;&#x4FE1;&#x7684;&#x7B11;&#x5BB9;&#x3002;</p>
<p>  &#x9646;&#x7476;&#x5FAE;&#x5FAE;&#x4E00;&#x7B11;&#xFF0C;&#x7AEF;&#x8D77;&#x77F3;&#x684C;&#x4E0A;&#x7684;&#x9152;&#x676F;&#xFF0C;&#x9152;&#x676F;&#x4E2D;&#xFF0C;&#x662F;&#x8457;&#x540D;&#x7684;&#x8840;&#x820C;&#x5170;&#x82B1;&#x9152;&#xFF0C;&#x6563;&#x53D1;&#x51FA;&#x6DE1;&#x6DE1;&#x7684;&#x6E05;&#x9999;&#x3002;</p>
<p>  &#x9646;&#x7476;&#x95EA;&#x7535;&#x822C;&#x7684;&#x5728;&#x9646;&#x9E23;&#x7684;&#x8138;&#x4E0A;&#x4EB2;&#x4E86;&#x4E00;&#x53E3;&#xFF0C;&#x8138;&#x8272;&#x7F9E;&#x7EA2;&#xFF0C;&#x7AEF;&#x8D77;&#x9152;&#x676F;&#x9053;&#xFF1A;&#x201C;&#x9E23;&#x54E5;&#x54E5;&#xFF0C;&#x6765;&#xFF0C;&#x7476;&#x513F;&#x8D4F;&#x4F60;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x63A5;&#x8FC7;&#x9152;&#x676F;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x7476;&#x513F;&#xFF0C;&#x4F60;&#x6BCF;&#x5929;&#x90FD;&#x8BF7;&#x6211;&#x559D;&#x4E00;&#x676F;&#x8840;&#x820C;&#x5170;&#x82B1;&#x9152;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x5F88;&#x611F;&#x8C22;&#x6709;&#x4F60;&#x966A;&#x5728;&#x6211;&#x8EAB;&#x8FB9;&#x3002;&#x201D;</p>
<p>  &#x8A00;&#x7F62;&#xFF0C;&#x7AEF;&#x8D77;&#x9152;&#x676F;&#xFF0C;&#x4E00;&#x996E;&#x800C;&#x5C3D;&#x3002;</p>
<p>  &#x9152;&#x9999;&#x5728;&#x820C;&#x5C16;&#x7F2D;&#x7ED5;&#x7684;&#xFF0C;&#x9646;&#x9E23;&#x7684;&#x5FC3;&#x5C31;&#x50CF;&#x662F;&#x9152;&#x9999;&#x4E00;&#x6837;&#x751C;&#x871C;&#xFF0C;&#x4F46;&#x4E0B;&#x4E00;&#x523B;&#xFF0C;&#x4ED6;&#x611F;&#x89C9;&#x6709;&#x4E9B;&#x5929;&#x65CB;&#x5730;&#x8F6C;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x7476;&#x513F;&#xFF0C;&#x6211;&#x600E;&#x4E48;&#x6709;&#x70B9;&#x6655;&#xFF1F;&#x4F60;&#x8FD9;&#x9152;...&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x6276;&#x7740;&#x77F3;&#x684C;&#xFF0C;&#x770B;&#x5411;&#x9646;&#x7476;&#xFF0C;&#x4F46;&#x6B64;&#x65F6;&#xFF0C;&#x4ED6;&#x53D1;&#x73B0;&#x9646;&#x7476;&#x7684;&#x8138;&#x8272;&#x6709;&#x70B9;&#x51B7;&#x3002;</p>
<p>  &#x201C;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x9646;&#x9E23;&#xFF0C;&#x7476;&#x513F;&#x966A;&#x4F60;&#x4E09;&#x5E74;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x517B;&#x8109;&#xFF0C;&#x73B0;&#x5728;&#x65F6;&#x671F;&#x5DF2;&#x5230;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x8840;&#x8109;&#x8D21;&#x732E;&#x51FA;&#x6765;&#x5427;&#xFF1F;&#x201D;</p>
<p>  &#x6B64;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2D;&#x5E74;&#x7537;&#x5B50;&#x4ECE;&#x4E00;&#x65C1;&#x51FA;&#x73B0;&#xFF0C;&#x662F;&#x9646;&#x7476;&#x7684;&#x7236;&#x4EB2;&#x3002;</p>
<p>  &#x8F70;&#x9686;&#x9686;&#xFF01;</p>
<p>  &#x5B9B;&#x5982;&#x6674;&#x5929;&#x9739;&#x96F3;&#xFF0C;&#x5728;&#x9646;&#x9E23;&#x8111;&#x6D77;&#x4E2D;&#x70B8;&#x54CD;&#x3002;</p>
<p>  &#x201C;&#x7476;&#x513F;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x4E0D;&#x53EF;&#x7F6E;&#x4FE1;&#x7684;&#x770B;&#x5411;&#x9646;&#x7476;&#xFF0C;&#x4F46;&#x9646;&#x7476;&#x773C;&#x4E2D;&#x5C3D;&#x662F;&#x51B7;&#x6F20;&#x3002;</p>
<p>  &#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x6211;&#x90A3;&#x4E48;&#x7231;&#x4F60;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x7476;&#x51B7;&#x6F20;&#x7684;&#x773C;&#x795E;&#xFF0C;&#x50CF;&#x662F;&#x4E00;&#x628A;&#x628A;&#x5C16;&#x5200;&#xFF0C;&#x523A;&#x8FDB;&#x9646;&#x9E23;&#x7684;&#x5FC3;&#x4E2D;&#xFF0C;&#x4ED6;&#x5927;&#x543C;&#x4E00;&#x58F0;&#xFF0C;&#x5411;&#x7740;&#x9646;&#x7476;&#x6251;&#x53BB;&#x3002;</p>
<p>  &#x4F46;&#x9646;&#x7476;&#x53EA;&#x662F;&#x5FAE;&#x5FAE;&#x4E00;&#x9000;&#xFF0C;&#x4ED6;&#x4FBF;&#x6251;&#x5230;&#x5728;&#x5730;&#x4E0A;&#x3002;</p>
<p>  &#x201C;&#x7384;&#x5143;&#x5251;&#x6D3E;&#x7AEF;&#x6728;&#x9E9F;&#xFF0C;&#x516D;&#x5C81;&#x4FEE;&#x70BC;&#xFF0C;&#x534A;&#x5E74;&#x6253;&#x901A;&#x4E24;&#x6761;&#x795E;&#x8109;&#xFF0C;&#x8DE8;&#x5165;&#x6B66;&#x58EB;&#x5883;&#xFF0C;&#x4E5D;&#x5C81;&#x8DE8;&#x5165;&#x6B66;&#x5E08;&#x5883;&#xFF0C;&#x5982;&#x4ECA;&#x5341;&#x516D;&#x5C81;&#xFF0C;&#x7384;&#x5143;&#x5251;&#x6D3E;&#x56DB;&#x5927;&#x5929;&#x624D;&#x4E4B;&#x4E00;&#xFF0C;&#x800C;&#x4F60;&#x5462;&#xFF0C;&#x4F53;&#x5F31;&#x591A;&#x75C5;&#xFF0C;&#x7ECF;&#x8109;&#x5835;&#x585E;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x5E9F;&#x7269;&#x800C;&#x5DF2;&#xFF0C;&#x5C31;&#x7B97;&#x4F60;&#x89C9;&#x9192;&#x4E86;&#x8840;&#x8109;&#xFF0C;&#x4E5F;&#x8FD8;&#x662F;&#x5E9F;&#x7269;&#xFF0C;&#x4F60;&#x80FD;&#x548C;&#x7AEF;&#x6728;&#x9E9F;&#x6BD4;&#x5417;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x8FD9;&#x6837;&#x7684;&#x5929;&#x624D;&#xFF0C;&#x624D;&#x662F;&#x6211;&#x9646;&#x7476;&#x7684;&#x826F;&#x914D;&#xFF0C;&#x60F3;&#x4E0E;&#x4E4B;&#x8054;&#x59FB;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x89C9;&#x9192;&#x5F3A;&#x5927;&#x7684;&#x8840;&#x8109;&#xFF0C;&#x4F60;&#x65E2;&#x7136;&#x90A3;&#x4E48;&#x7231;&#x6211;&#xFF0C;&#x4E0D;&#x5982;&#x6210;&#x5168;&#x6211;&#xFF0C;&#x4EE5;&#x4F60;&#x7684;&#x8840;&#x8109;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x89C9;&#x9192;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x8840;&#x8109;&#x3002;&#x201D;</p>
<p>  &#x51B7;&#x6F20;&#x7684;&#x58F0;&#x97F3;&#x4ECE;&#x9646;&#x7476;&#x53E3;&#x4E2D;&#x53D1;&#x51FA;&#x3002;</p>
<p>  &#x78B0;&#xFF01;</p>
<p>  &#x6B64;&#x65F6;&#xFF0C;&#x4E2D;&#x5E74;&#x7537;&#x5B50;&#x4E00;&#x811A;&#x8E29;&#x5728;&#x9646;&#x9E23;&#x7684;&#x80CC;&#x4E0A;&#xFF0C;&#x624B;&#x4E2D;&#x51FA;&#x73B0;&#x4E00;&#x67C4;&#x5C16;&#x5200;&#xFF0C;&#x53EB;&#x5230;&#xFF1A;&#x201C;&#x9646;&#x9E23;&#xFF0C;&#x732E;&#x51FA;&#x4F60;&#x7684;&#x8840;&#x8109;&#x5427;&#xFF01;&#x201D;</p>
<p>  &#x554A;&#xFF01;</p>
<p>  &#x810A;&#x690E;&#x5904;&#xFF0C;&#x94BB;&#x5FC3;&#x7684;&#x75DB;&#x75BC;&#x77AC;&#x95F4;&#x6DF9;&#x6CA1;&#x4E86;&#x9646;&#x9E23;&#xFF0C;&#x9646;&#x9E23;&#x5636;&#x543C;&#xFF0C;&#x58F0;&#x97F3;&#x4E2D;&#x6EE1;&#x662F;&#x5B64;&#x72EC;&#x65E0;&#x52A9;&#x4EE5;&#x53CA;&#x7EDD;&#x671B;&#x3002;</p>
<p>  &#x6E10;&#x6E10;&#xFF0C;&#x9646;&#x9E23;&#x9677;&#x5165;&#x4E86;&#x65E0;&#x8FB9;&#x7684;&#x9ED1;&#x6697;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x7476;&#xFF0C;&#x6211;&#x5F85;&#x4F60;&#x5982;&#x631A;&#x7231;&#xFF0C;&#x4F60;&#x4E3A;&#x4F55;&#x8981;&#x5BB3;&#x6211;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x5927;&#x543C;&#x4E00;&#x58F0;&#xFF0C;&#x731B;&#x7136;&#x4ECE;&#x5E8A;&#x4E0A;&#x5750;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x538B;&#x7684;&#x6960;&#x6728;&#x5236;&#x4F5C;&#x7684;&#x5E8A;&#x4E00;&#x58F0;&#x2018;&#x560E;&#x5431;&#x2019;&#x54CD;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6EE1;&#x5934;&#x5927;&#x6C57;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x4E00;&#x573A;&#x68A6;&#x3002;</p>
<p>  &#x4E0D;&#xFF0C;&#x90A3;&#x4E0D;&#x662F;&#x68A6;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x573A;&#x68A6;&#x5462;&#xFF0C;&#x90A3;&#x662F;&#x4E09;&#x5929;&#x524D;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x5B9E;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#xFF0C;&#x98CE;&#x706B;&#x6210;&#x9646;&#x5BB6;&#x4E3B;&#x8109;&#x4F20;&#x4EBA;&#xFF0C;&#x4ED6;&#x7236;&#x4EB2;&#x662F;&#x9646;&#x5BB6;&#x5BB6;&#x4E3B;&#x3002;&#x800C;&#x9646;&#x7476;&#xFF0C;&#x9646;&#x5BB6;&#x7B2C;&#x4E00;&#x652F;&#x8109;&#x5927;&#x957F;&#x8001;&#x7684;&#x5973;&#x513F;&#x3002;</p>
<p>  &#x4E24;&#x4EBA;&#x540C;&#x5B97;&#x4E0D;&#x540C;&#x8109;&#xFF0C;&#x4ECE;&#x5C0F;&#x4E00;&#x8D77;&#x957F;&#x5927;&#xFF0C;&#x9752;&#x6885;&#x7AF9;&#x9A6C;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5F62;&#x5F71;&#x4E0D;&#x79BB;&#xFF0C;&#x79C1;&#x4E0B;&#x91CC;&#x751A;&#x81F3;&#x5DF2;&#x7ECF;&#x5C71;&#x76DF;&#x6D77;&#x8A93;&#xFF0C;&#x79C1;&#x5B9A;&#x7EC8;&#x8EAB;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x600E;&#x4E48;&#x4E5F;&#x60F3;&#x4E0D;&#x5230;&#xFF0C;&#x9646;&#x7476;&#x4F1A;&#x548C;&#x5927;&#x957F;&#x8001;&#x5BF9;&#x4ED6;&#x51FA;&#x624B;&#xFF0C;&#x593A;&#x4ED6;&#x8840;&#x8109;&#x3002;</p>
<p>  &#x201C;&#x5B9E;&#x529B;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5B9E;&#x529B;&#x4E0D;&#x8DB3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x5929;&#x8D4B;&#x8D85;&#x51E1;&#xFF0C;&#x5B9E;&#x529B;&#x5F3A;&#x5927;&#xFF0C;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x6562;&#x8FD9;&#x4E48;&#x5BF9;&#x6211;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x53CC;&#x62F3;&#x7D27;&#x63E1;&#xFF0C;&#x6D51;&#x8EAB;&#x98A4;&#x6296;&#xFF0C;&#x53CC;&#x773C;&#x6EE1;&#x662F;&#x8840;&#x4E1D;&#x3002;</p>
<p>  &#x5E9F;&#x7269;&#xFF01;</p>
<p>  &#x8FD9;&#x662F;&#x9646;&#x7476;&#x5BF9;&#x4ED6;&#x7684;&#x79F0;&#x547C;&#xFF0C;&#x9646;&#x7476;&#x4E09;&#x5929;&#x524D;&#x7684;&#x8BDD;&#x4EFF;&#x4F5B;&#x8FD8;&#x5728;&#x8033;&#x8FB9;&#x56DE;&#x54CD;&#x3002;</p>
<p>  &#x5431;&#x5440;&#xFF01;</p>
<p>  &#x8FD9;&#x65F6;&#xFF0C;&#x623F;&#x95E8;&#x88AB;&#x63A8;&#x5F00;&#xFF0C;&#x8D70;&#x8FDB;&#x4E00;&#x4E2A;&#x8EAB;&#x4F53;&#x67D4;&#x5F31;&#x7684;&#x4E2D;&#x5E74;/&#x5987;/&#x4EBA;&#xFF0C;&#x770B;&#x7740;&#x5E8A;&#x4E0A;&#x7684;&#x9646;&#x9E23;&#xFF0C;&#x5173;&#x5207;&#x7684;&#x95EE;&#xFF1A;&#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x53C8;&#x505A;&#x5669;&#x68A6;&#x770B;&#x5417;&#xFF1F;&#x201D;</p>
<p>  &#x8FD9;&#x4E2A;&#x7F8E;&#x5987;&#x4EBA;&#xFF0C;&#x662F;&#x9646;&#x9E23;&#x7684;&#x6BCD;&#x4EB2;&#xFF0C;&#x674E;&#x840D;&#x3002;</p>
<p>  &#x4E09;&#x5929;&#x524D;&#xFF0C;&#x5C31;&#x662F;&#x674E;&#x840D;&#x62C5;&#x5FC3;&#x9646;&#x9E23;&#x7684;&#x5B89;&#x5371;&#xFF0C;&#x51FA;&#x53BB;&#x5BFB;&#x627E;&#xFF0C;&#x624D;&#x6551;&#x4E86;&#x9646;&#x9E23;&#xFF0C;&#x4E0D;&#x7136;&#x9646;&#x9E23;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#x3002;</p>
<p>  &#x81EA;&#x4ECE;&#x516D;&#x5E74;&#x524D;&#x4F20;&#x51FA;&#x9646;&#x9E23;&#x7684;&#x7236;&#x4EB2;&#x5728;&#x5916;&#x9762;&#x6E38;&#x5386;&#x88AB;&#x4EBA;&#x51FB;&#x6740;&#x540E;&#xFF0C;&#x4ED6;&#x5C31;&#x4E0E;&#x674E;&#x840D;&#x76F8;&#x4F9D;&#x4E3A;&#x547D;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x770B;&#x7740;&#x674E;&#x840D;&#xFF0C;&#x773C;&#x795E;&#x53D8;&#x7684;&#x67D4;&#x548C;&#x8D77;&#x6765;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x5A18;&#xFF0C;&#x6CA1;&#x4E8B;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x68A6;&#x800C;&#x5DF2;&#x3002;&#x201D;</p>
<p>  &#x770B;&#x7740;&#x9646;&#x9E23;&#x82CD;&#x767D;&#x7684;&#x8138;&#x8272;&#xFF0C;&#x674E;&#x840D;&#x5750;&#x5728;&#x9646;&#x9E23;&#x5E8A;&#x8FB9;&#xFF0C;&#x6478;&#x7740;&#x9646;&#x9E23;&#x7684;&#x989D;&#x5934;&#xFF0C;&#x5FC3;&#x75DB;&#x7684;&#x9053;&#xFF1A;&#x201C;&#x5DF2;&#x7ECF;&#x4E09;&#x5929;&#x4E86;&#xFF0C;&#x4F60;&#x6BCF;&#x6B21;&#x90FD;&#x5927;&#x53EB;&#x9646;&#x7476;&#x5BB3;&#x4F60;&#xFF0C;&#x9E23;&#x513F;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;?&#x96BE;&#x9053;&#x662F;&#x4F60;&#x7684;&#x4F24;&#x662F;&#x56E0;&#x4E3A;&#x9646;&#x7476;...&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x9053;&#xFF1A;&#x201C;&#x5A18;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x542C;&#x9519;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x5E76;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x674E;&#x840D;&#x662F;&#x9646;&#x7476;&#x4E0E;&#x5927;&#x957F;&#x8001;&#x5E72;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x674E;&#x840D;&#x5E76;&#x6CA1;&#x6709;&#x4FEE;&#x6B66;&#x9053;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x674E;&#x840D;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x5BB3;&#x4E86;&#x5979;&#x3002;</p>
<p>  &#x674E;&#x840D;&#x8E1F;&#x8E70;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4EE5;&#x540E;&#x5728;&#x4ED6;&#x4EBA;&#x9762;&#x524D;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x547C;&#x9646;&#x7476;&#x7684;&#x540D;&#x5B57;&#x4E86;&#xFF0C;&#x4E24;&#x5929;&#x524D;&#xFF0C;&#x9646;&#x7476;&#x89C9;&#x9192;&#x4E86;&#x4E94;&#x7EA7;&#x8840;&#x8109;&#xFF0C;&#x8FD8;&#x6253;&#x901A;&#x4E86;&#x4E00;&#x6761;&#x795E;&#x7EA7;&#x7ECF;&#x8109;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x957F;&#x8001;&#x9662;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x4E24;&#x4E2A;&#x6708;&#x540E;&#x7684;&#x65CF;&#x4F1A;&#x4E0A;&#xFF0C;&#x5C06;&#x6267;&#x638C;&#x9646;&#x5BB6;&#xFF0C;&#x6210;&#x4E3A;&#x9646;&#x5BB6;&#x4E4B;&#x4E3B;&#xFF0C;&#x76F4;&#x547C;&#x5BB6;&#x4E3B;&#x4E4B;&#x540D;&#xFF0C;&#x6050;&#x6015;&#x4F1A;&#x88AB;&#x4EBA;&#x8BF4;&#x4E3A;&#x4E0D;&#x656C;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x4EC0;&#x4E48;&#xFF1F;&#x9646;&#x7476;&#x8981;&#x6267;&#x638C;&#x9646;&#x5BB6;&#xFF1F;&#x5979;&#x4F11;&#x60F3;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x53D1;&#x51FA;&#x4F4E;&#x6C89;&#x7684;&#x6012;&#x543C;&#xFF0C;&#x773C;&#x775B;&#x5145;&#x8840;&#xFF0C;&#x7259;&#x5173;&#x54AC;&#x7684;&#x54AF;&#x54AF;&#x4F5C;&#x54CD;&#xFF0C;&#x7259;&#x9F7F;&#x90FD;&#x8981;&#x54AC;&#x788E;&#x4E86;&#xFF0C;&#x9C9C;&#x8840;&#x90FD;&#x6D41;&#x51FA;&#x6765;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x7684;&#x7236;&#x4EB2;&#x516D;&#x5E74;&#x524D;&#x4F20;&#x8A00;&#x88AB;&#x4EBA;&#x51FB;&#x6740;&#x540E;&#xFF0C;&#x8FD9;&#x516D;&#x5E74;&#x6765;&#xFF0C;&#x9646;&#x5BB6;&#x4E00;&#x76F4;&#x7531;&#x957F;&#x8001;&#x9662;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x7ACB;&#x65B0;&#x7684;&#x5BB6;&#x4E3B;&#x3002;</p>
<p>  &#x770B;&#x5230;&#x9646;&#x9E23;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x674E;&#x840D;&#x5413;&#x5F97;&#x516D;&#x795E;&#x65E0;&#x4E3B;&#xFF0C;&#x53EA;&#x662F;&#x62B1;&#x7740;&#x9646;&#x9E23;&#x7684;&#x5934;&#xFF0C;&#x773C;&#x6CEA;&#x4E0D;&#x65AD;&#x6D41;&#x4E0B;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x4E0D;&#x8981;&#x5413;&#x5A18;&#x554A;&#xFF0C;&#x5A18;&#x5DF2;&#x7ECF;&#x5931;&#x53BB;&#x4E86;&#x4F60;&#x7239;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x5931;&#x53BB;&#x4F60;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x7239;...&#x4F60;&#x5230;&#x5E95;&#x5728;&#x54EA;&#x554A;&#xFF0C;&#x9E23;&#x513F;&#x76F8;&#x4FE1;&#x4F60;&#x4E0D;&#x4F1A;&#x6B7B;&#x7684;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x9E23;&#x513F;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF0C;&#x8FDE;&#x5BB6;&#x4E3B;&#x4E4B;&#x4F4D;&#x90FD;&#x8981;&#x4FDD;&#x4E0D;&#x4F4F;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x7D27;&#x7D27;&#x7684;&#x63E1;&#x7740;&#x8116;&#x5B50;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x6302;&#x5760;&#xFF0C;&#x7531;&#x4E8E;&#x592A;&#x7528;&#x529B;&#xFF0C;&#x6307;&#x7532;&#x90FD;&#x523A;&#x8FDB;&#x4E86;&#x8089;&#x91CC;&#xFF0C;&#x9C9C;&#x8840;&#x4E0D;&#x65AD;&#x6E17;&#x51FA;&#x3002;</p>
<p>  &#x8FD9;&#x4E2A;&#x6302;&#x5760;&#xFF0C;&#x9752;&#x94DC;&#x6240;&#x94F8;&#xFF0C;&#x8695;&#x8C46;&#x5927;&#x5C0F;&#xFF0C;&#x662F;&#x9646;&#x9E23;&#x7684;&#x7236;&#x4EB2;&#x51FA;&#x4E8B;&#x4E4B;&#x524D;&#xFF0C;&#x6258;&#x4EBA;&#x4ECE;&#x5916;&#x9762;&#x9001;&#x56DE;&#x6765;&#x7684;&#xFF0C;&#x8FD9;&#x516D;&#x5E74;&#xFF0C;&#x9646;&#x9E23;&#x4E00;&#x76F4;&#x5E26;&#x5728;&#x8EAB;&#x8FB9;&#x3002;</p>
<p>  &#x624B;&#x638C;&#x7684;&#x9C9C;&#x8840;&#x6E17;&#x51FA;&#xFF0C;&#x6D41;&#x5411;&#x4E86;&#x9752;&#x94DC;&#x6302;&#x5760;&#x3002;</p>
<p>  &#x55E1;&#xFF01;</p>
<p>  &#x5FFD;&#x7136;&#xFF0C;&#x9752;&#x94DC;&#x6302;&#x5760;&#x8F7B;&#x5FAE;&#x7684;&#x6296;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x53D8;&#x7684;&#x6EDA;&#x70EB;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x8FD8;&#x6CA1;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x9752;&#x94DC;&#x6302;&#x5760;&#x4E00;&#x9707;&#x4E4B;&#x4E0B;&#xFF0C;&#x5C45;&#x7136;&#x5316;&#x4E3A;&#x70B9;&#x70B9;&#x7C89;&#x672B;&#xFF0C;&#x5F80;&#x9646;&#x9E23;&#x624B;&#x5FC3;&#x4E00;&#x94BB;&#xFF0C;&#x8FDB;&#x5165;&#x5230;&#x624B;&#x5FC3;&#x4E2D;&#x6D88;&#x5931;&#x4E0D;&#x89C1;&#x3002;</p>
<p>  &#x63A5;&#x7740;&#xFF0C;&#x9646;&#x9E23;&#x4FBF;&#x611F;&#x89C9;&#xFF0C;&#x6709;&#x4E00;&#x80A1;&#x6EDA;&#x70EB;&#x7684;&#x80FD;&#x91CF;&#xFF0C;&#x4ECE;&#x4ED6;&#x7684;&#x624B;&#x5FC3;&#xFF0C;&#x987A;&#x7740;&#x624B;&#x81C2;&#xFF0C;&#x4E00;&#x53EA;&#x5F80;&#x4E0A;&#xFF0C;&#x4E00;&#x4F1A;&#x4E4B;&#x540E;&#xFF0C;&#x4FBF;&#x505C;&#x7559;&#x5728;&#x7709;&#x5FC3;&#x7684;&#x5370;&#x5802;&#x7A74;&#x4E2D;&#x3002;</p>
<p>  &#x201C;&#x4E5D;&#x9F99;&#x4E0D;&#x6B7B;&#xFF0C;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF01;&#x201D;</p>
<p>  &#x7A81;&#x7136;&#xFF0C;&#x4E00;&#x58F0;&#x5DE8;&#x5927;&#x7684;&#x543C;&#x58F0;&#x5728;&#x9646;&#x9E23;&#x7684;&#x8111;&#x6D77;&#x4E2D;&#x54CD;&#x8D77;&#xFF0C;&#x9707;&#x7684;&#x9646;&#x9E23;&#x8111;&#x6D77;&#x55E1;&#x55E1;&#x4F5C;&#x54CD;&#x3002;</p>
<p>  &#x201C;&#x4E5D;&#x9F99;&#x4E0D;&#x6B7B;&#xFF0C;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x4E5D;&#x9F99;&#x4E0D;&#x6B7B;&#xFF0C;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF01;&#x201D;</p>
<p>  ......</p>
<p>  &#x8FDE;&#x7EED;&#x7684;&#x543C;&#x58F0;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x5728;&#x9646;&#x9E23;&#x8111;&#x6D77;&#x4E2D;&#x54CD;&#x8D77;&#xFF0C;&#x968F;&#x540E;&#xFF0C;&#x4E00;&#x80A1;&#x7099;&#x70ED;&#x7684;&#x6C14;&#x606F;&#xFF0C;&#x4ECE;&#x7709;&#x5FC3;&#x4E2D;&#x51FA;&#x53D1;&#xFF0C;&#x6D8C;&#x5411;&#x9646;&#x9E23;&#x7684;&#x810A;&#x690E;&#x9AA8;&#x3002;</p>
<p>  &#x4E0B;&#x4E00;&#x523B;&#xFF0C;&#x543C;&#x58F0;&#x6D88;&#x5931;&#xFF0C;&#x4F46;&#x810A;&#x690E;&#x9AA8;&#x4E0A;&#xFF0C;&#x5374;&#x6709;&#x4E00;&#x9635;&#x9635;&#x9EBB;&#x75D2;&#x4F20;&#x51FA;&#xFF0C;&#x5168;&#x8EAB;&#x53D8;&#x7684;&#x6EDA;&#x70EB;&#x3002;</p>
<p>  &#x201C;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x5B8C;&#x5168;&#x6478;&#x4E0D;&#x7740;&#x5934;&#x8111;&#x3002;</p>
<p>  &#x6B64;&#x65F6;&#xFF0C;&#x810A;&#x690E;&#x9AA8;&#x4E0A;&#x7684;&#x9EBB;&#x75D2;&#x66F4;&#x52A0;&#x5267;&#x70C8;&#x4E86;&#xFF0C;&#x4F3C;&#x4E4E;&#x6709;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x5728;&#x6162;&#x6162;&#x7684;&#x751F;&#x957F;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x5413;&#x5A18;&#x554A;&#x3002;&#x201D;</p>
<p>  &#x611F;&#x53D7;&#x5230;&#x9646;&#x9E23;&#x8EAB;&#x4E0A;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x674E;&#x840D;&#x66F4;&#x6015;&#xFF0C;&#x6709;&#x4E9B;&#x624B;&#x8DB3;&#x65E0;&#x63AA;&#x3002;</p>
<p>  &#x201C;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF1F;&#x96BE;&#x9053;&#x6211;&#x771F;&#x7684;&#x80FD;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF1F;&#x201D;&#x9646;&#x9E23;&#x5FC3;&#x91CC;&#x7591;&#x60D1;&#x3002;</p>
<p>  &#x53E4;&#x7C4D;&#x6709;&#x8BB0;&#x8F7D;&#xFF0C;&#x53EA;&#x6709;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x4EBA;&#xFF0C;&#x8840;&#x8109;&#x88AB;&#x5265;&#x593A;&#x540E;&#xFF0C;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x635F;&#x574F;&#x540E;&#xFF0C;&#x80FD;&#x591F;&#x8840;&#x8109;&#x91CD;&#x751F;&#xFF0C;&#x91CD;&#x65B0;&#x751F;&#x957F;&#x51FA;&#x4E00;&#x9053;&#x8840;&#x8109;&#x3002;</p>
<p>  &#x4F46;&#x662F;&#x91CD;&#x751F;&#x7684;&#x8840;&#x8109;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7B49;&#x7EA7;&#x90FD;&#x5F88;&#x4F4E;&#xFF0C;&#x6CA1;&#x6709;&#x5927;&#x7528;&#x3002;</p>
<p>  &#x4F46;&#x4E5F;&#x6709;&#x6781;&#x5C11;&#x6781;&#x5C11;&#x7684;&#x4E00;&#x4E9B;&#x4EBA;&#xFF0C;&#x80FD;&#x591F;&#x7834;&#x800C;&#x540E;&#x7ACB;&#xFF0C;&#x7834;&#x8327;&#x91CD;&#x751F;&#xFF0C;&#x4E8E;&#x6BC1;&#x706D;&#x4E2D;&#x5D1B;&#x8D77;&#xFF0C;&#x8D85;&#x8131;&#x8FC7;&#x53BB;&#xFF0C;&#x89C9;&#x9192;&#x81F3;&#x5F3A;&#x8840;&#x8109;&#x3002;</p>
<p>  &#x4F46;&#x8FD9;&#x51E0;&#x7387;&#x5C0F;&#x5230;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#xFF0C;&#x53E4;&#x7C4D;&#x8BB0;&#x8F7D;&#xFF0C;&#x53E4;&#x6765;&#x90FD;&#x6CA1;&#x6709;&#x51E0;&#x4F8B;&#x3002;</p>
<p>  &#x8D85;&#x8131;&#x8FC7;&#x53BB;&#xFF0C;&#x89C9;&#x9192;&#x81F3;&#x5F3A;&#x8840;&#x8109;&#xFF0C;&#x9646;&#x9E23;&#x6CA1;&#x6709;&#x53BB;&#x60F3;&#xFF0C;&#x90A3;&#x6BD5;&#x7ADF;&#x51E0;&#x7387;&#x592A;&#x5C0F;&#x4E86;&#xFF0C;&#x4ED6;&#x53EA;&#x8981;&#x80FD;&#x89C9;&#x9192;&#x51FA;&#x8840;&#x8109;&#xFF0C;&#x5C31;&#x975E;&#x5E38;&#x9AD8;&#x5174;&#x4E86;&#x3002;</p>
<p>  &#x6709;&#x4E86;&#x8840;&#x8109;&#xFF0C;&#x4ED6;&#x5C31;&#x80FD;&#x4FEE;&#x70BC;&#x6B66;&#x9053;&#x4E86;&#xFF0C;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x7684;&#x547D;&#x8FD0;&#x3002;</p>
<p>  &#x8FD9;&#x65F6;&#xFF0C;&#x8EAB;&#x4E0A;&#x5F02;&#x6837;&#x6162;&#x6162;&#x6D88;&#x5931;&#xFF0C;&#x9646;&#x9E23;&#x8138;&#x4E0A;&#x9732;&#x51FA;&#x4E86;&#x7B11;&#x5BB9;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x5A18;&#xFF0C;&#x6211;&#x6CA1;&#x4E8B;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x4F60;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x91CC;&#x662F;&#x4E3B;&#x5E9C;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x786C;&#x95EF;&#x3002;&#x201D;</p>
<p>  &#x7A81;&#x7136;&#xFF0C;&#x5916;&#x9762;&#x4F20;&#x6765;&#x4E00;&#x58F0;&#x5A07;&#x559D;&#xFF0C;&#x9646;&#x9E23;&#x542C;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x662F;&#x674E;&#x840D;&#x7684;&#x8D34;&#x8EAB;&#x5A62;&#x5973;&#x79CB;&#x6708;&#x7684;&#x58F0;&#x97F3;&#x3002;</p>
<p>  &#x201C;&#x556A;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x6EDA;&#x5F00;&#xFF01;&#x201D;</p>
<p>  &#x4E00;&#x58F0;&#x51B7;&#x559D;&#xFF0C;&#x5939;&#x5E26;&#x7740;&#x4E00;&#x58F0;&#x5DF4;&#x638C;&#x58F0;&#xFF0C;&#x968F;&#x540E;&#x4E00;&#x4E2A;&#x8138;&#x8272;&#x6709;&#x4E9B;&#x9634;&#x6C89;&#x7684;&#x9752;&#x5E74;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x592B;&#x4EBA;&#xFF0C;&#x5C11;&#x7237;&#xFF01;&#x201D;&#x4E00;&#x4E2A;&#x5341;&#x516D;&#x5C81;&#x5DE6;&#x53F3;&#x7684;&#x5C11;&#x5973;&#x8DDF;&#x4E86;&#x8FDB;&#x6765;&#xFF0C;&#x8138;&#x4E0A;&#x7EA2;&#x80BF;&#xFF0C;&#x6D6E;&#x73B0;&#x51FA;&#x4E00;&#x4E2A;&#x5DF4;&#x638C;&#x5370;&#xFF0C;&#x6B63;&#x662F;&#x79CB;&#x6708;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x5DDD;&#xFF0C;&#x662F;&#x4F60;&#xFF1F;&#x4F60;&#x60F3;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x8D77;&#x8EAB;&#xFF0C;&#x4E00;&#x58F0;&#x51B7;&#x559D;&#x3002;</p>
<p>  &#x6765;&#x4EBA;&#x540D;&#x53EB;&#x9646;&#x5DDD;&#xFF0C;&#x4E43;&#x662F;&#x9646;&#x7476;&#x7684;&#x5927;&#x54E5;&#xFF0C;&#x6BD4;&#x9646;&#x7476;&#x5927;&#x4E09;&#x4E00;&#x5C81;&#xFF0C;&#x4ECA;&#x5E74;&#x5341;&#x516D;&#x5C81;&#x3002;</p>
<p>  &#x9646;&#x5DDD;&#x770B;&#x5230;&#x9646;&#x9E23;&#xFF0C;&#x773C;&#x4E2D;&#x63A0;&#x8FC7;&#x8BE7;&#x5F02;&#x4E4B;&#x8272;&#xFF0C;&#x4F3C;&#x4E4E;&#x6709;&#x4E9B;&#x60CA;&#x8BB6;&#x9646;&#x9E23;&#x5C45;&#x7136;&#x6CA1;&#x6B7B;&#xFF0C;&#x968F;&#x540E;&#x4FBF;&#x662F;&#x4E00;&#x58F0;&#x51B7;&#x7B11;&#xFF1A;&#x201C;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x5728;&#x6B63;&#x597D;&#xFF0C;&#x6211;&#x59B9;&#x59B9;&#x9646;&#x7476;&#xFF0C;&#x5C06;&#x6267;&#x638C;&#x9646;&#x5BB6;&#xFF0C;&#x5165;&#x4F4F;&#x4E3B;&#x5E9C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E3B;&#x5E9C;&#xFF0C;&#x4F60;&#x4EEC;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x8D44;&#x683C;&#x4F4F;&#x4E86;&#xFF0C;&#x8D76;&#x7D27;&#x642C;&#x8D70;&#x5427;&#x3002;&#x201D;</p>
<p>  &#x674E;&#x840D;&#x8138;&#x8272;&#x4E00;&#x767D;&#xFF0C;&#x5979;&#x867D;&#x7136;&#x65E9;&#x5C31;&#x77E5;&#x9053;&#x4F1A;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x5929;&#xFF0C;&#x4F46;&#x6CA1;&#x60F3;&#x5230;&#x6765;&#x7684;&#x8FD9;&#x4E48;&#x5FEB;&#x3002;</p>
<p>  &#x674E;&#x840D;&#x60E8;&#x7136;&#x4E00;&#x7B11;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9646;&#x5DDD;&#xFF0C;&#x9E23;&#x513F;&#x8EAB;&#x4E0A;&#x6709;&#x4F24;&#xFF0C;&#x7B49;&#x8FC7;&#x4E24;&#x5929;&#x9E23;&#x513F;&#x4F24;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x5C31;&#x642C;&#x8D70;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x8FC7;&#x4E24;&#x5929;&#xFF1F;&#x4ECA;&#x5929;&#x5C31;&#x8981;&#x642C;&#x8D70;&#xFF0C;&#x4F60;&#x4EEC;&#x60F3;&#x8D56;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4EE5;&#x4E3A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5417;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x5DDD;&#x51B7;&#x7B11;&#x3002;</p>
<p>  &#x201C;&#x4ECA;&#x5929;&#xFF1F;&#x53EF;&#x9E23;&#x513F;&#x8EAB;&#x4E0A;&#x6709;&#x4F24;&#x554A;&#xFF0C;&#x4ECA;&#x5929;&#x90FD;&#x8FD9;&#x4E48;&#x665A;&#x4E86;&#xFF0C;&#x8BA9;&#x9E23;&#x513F;&#x4F11;&#x606F;&#x4E00;&#x591C;&#x5728;&#x642C;&#x5427;&#xFF01;&#x201D;</p>
<p>  &#x674E;&#x840D;&#x6709;&#x4E9B;&#x54C0;&#x6C42;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x4F11;&#x606F;&#xFF1F;&#x4ED6;&#x4E00;&#x4E2A;&#x8840;&#x8109;&#x90FD;&#x4E0D;&#x80FD;&#x89C9;&#x9192;&#xFF0C;&#x7ECF;&#x8109;&#x5835;&#x585E;&#x7684;&#x5E9F;&#x7269;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x4F11;&#x606F;&#x7684;&#xFF0C;&#x4E0D;&#x5982;&#x6B7B;&#x4E86;&#x7B97;&#x4E86;&#xFF0C;&#x597D;&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x4ECA;&#x5929;&#x4E00;&#x5B9A;&#x8981;&#x642C;&#x8D70;&#x3002;&#x201D;&#x9646;&#x5DDD;&#x4E00;&#x8138;&#x51B7;&#x6F20;&#x9053;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; ly@cqkjuniversity.com 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-01-06 17:32:49
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="readme.html" class="navigation navigation-prev " aria-label="Previous page: 目录">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2.html" class="navigation navigation-next " aria-label="Next page: 第二章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章","level":"1.3","depth":1,"next":{"title":"第二章","level":"1.4","depth":1,"path":"2.md","ref":"2.md","articles":[]},"previous":{"title":"目录","level":"1.2","depth":1,"path":"readme.md","ref":"readme.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","chapter-fold","code","splitter","-lunr","-search","search-pro","insert-logo","custom-favicon","pageview-count","tbfed-pagefooter","popup","-sharing","sharing-plus","donate","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy ly@cqkjuniversity.com 2021","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://i.loli.net/2021/01/06/AXCKm6Mp2oxFngb.png","wechatText":"微信"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"./icon/book.ico","back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 30px; min-height: 30px","url":"https://image.baidu.com/search/detail?ct=503316480&z=undefined&tn=baiduimagedetail&ipn=d&word=%E5%9B%BE%E7%89%87&step_word=&ie=utf-8&in=&cl=2&lm=-1&st=undefined&hd=undefined&latest=undefined&copyright=undefined&cs=2631334549,246605465&os=925726685,274215688&simid=4204922451,643817904&pn=59&rn=1&di=32230&ln=1566&fr=&fmq=1609933260618_R&fm=&ic=undefined&s=undefined&se=&sme=&tab=0&width=undefined&height=undefined&face=undefined&is=0,0&istype=0&ist=&jit=&bdtype=0&spn=0&pi=0&gsm=0&hs=2&objurl=https%3A%2F%2Fgimg2.baidu.com%2Fimage_search%2Fsrc%3Dhttp%253A%252F%252Fa4.att.hudong.com%252F52%252F35%252F01300000248079122537357453023.jpg%26refer%3Dhttp%253A%252F%252Fa4.att.hudong.com%26app%3D2002%26size%3Df9999%2C10000%26q%3Da80%26n%3D0%26g%3D0n%26fmt%3Djpeg%3Fsec%3D1612525262%26t%3D923b32ede80b565aa16a7dcf9153ebed&rpstart=0&rpnum=0&adpicid=0&force=undefined"}},"theme":"default","author":"liuyi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Linux大作业","language":"zh-hans","gitbook":"*","description":"666"},"file":{"path":"1.md","mtime":"2021-01-06T09:32:49.118Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-06T13:45:05.512Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

