
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 · Linux大作业</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="liuyi">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4.html" />
    
    
    <link rel="prev" href="2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;3&#x7AE0;-&#x51DD;&#x70BC;&#x771F;&#x6C14;">&#x7B2C;3&#x7AE0; &#x51DD;&#x70BC;&#x771F;&#x6C14;</h1>
<p>&#x7B49;&#x5230;&#x6D17;&#x9AD3;&#x4E39;&#x7684;&#x836F;&#x529B;&#x5168;&#x90E8;&#x70BC;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x7B2C;&#x4E8C;&#x5929;&#x4E34;&#x8FD1;&#x4E2D;&#x5348;&#x4E86;&#x3002;</p>
<p>  &#x4E00;&#x591C;&#x6CA1;&#x7761;&#xFF0C;&#x4F46;&#x9646;&#x9E23;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x56F0;&#xFF0C;&#x53CD;&#x800C;&#x611F;&#x89C9;&#x795E;&#x6E05;&#x6C14;&#x723D;&#xFF0C;&#x6D51;&#x8EAB;&#x5145;&#x6EE1;&#x4E86;&#x529B;&#x91CF;&#x3002;</p>
<p>  &#x4E00;&#x9897;&#x6D17;&#x9AD3;&#x4E39;&#xFF0C;&#x8BA9;&#x4ED6;&#x5F7B;&#x5E95;&#x8715;&#x53D8;&#xFF0C;&#x8EAB;&#x4F53;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x8FD8;&#x5F3A;&#x58EE;&#xFF0C;&#x7ECF;&#x8109;&#x4E5F;&#x4E0D;&#x5728;&#x5835;&#x585E;&#xFF0C;&#x5145;&#x6EE1;&#x4E86;&#x97E7;&#x6027;&#x4E0E;&#x6D3B;&#x529B;&#x3002;</p>
<p>  &#x53EA;&#x662F;&#x4ED6;&#x8EAB;&#x4E0A;&#x6709;&#x4E00;&#x5C42;&#x5C42;&#x539A;&#x539A;&#x7684;&#x6C61;&#x57A2;&#xFF0C;&#x90FD;&#x662F;&#x6392;&#x51FA;&#x6765;&#x7684;&#x6742;&#x8D28;&#xFF0C;&#x9ECF;&#x7CCA;&#x7CCA;&#x7684;&#xFF0C;&#x975E;&#x5E38;&#x96BE;&#x53D7;&#x3002;</p>
<p>  &#x5FC3;&#x5FF5;&#x4E00;&#x52A8;&#xFF0C;&#x9646;&#x9E23;&#x4FBF;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x4E86;&#x623F;&#x95F4;&#x4E2D;&#x3002;</p>
<p>  &#x8E51;&#x624B;&#x8E51;&#x811A;&#x7684;&#x6253;&#x5F00;&#x623F;&#x95E8;&#x8D70;&#x4E86;&#x51FA;&#x53BB;&#xFF0C;&#x53D1;&#x73B0;&#x674E;&#x840D;&#x548C;&#x79CB;&#x6708;&#x90FD;&#x4E0D;&#x5728;&#xFF0C;&#x60F3;&#x6765;&#x5E94;&#x8BE5;&#x662F;&#x51FA;&#x53BB;&#x4E70;&#x83DC;&#x53BB;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x5230;&#x9662;&#x5B50;&#x4E2D;&#x7684;&#x4E95;&#x8FB9;&#xFF0C;&#x6253;&#x8D77;&#x4E95;&#x6C34;&#x5C06;&#x8EAB;&#x4E0A;&#x7684;&#x6C61;&#x57A2;&#x51B2;&#x7684;&#x5E72;&#x5E72;&#x51C0;&#x51C0;&#xFF0C;&#x6362;&#x4E86;&#x4E00;&#x5957;&#x5E72;&#x51C0;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x987F;&#x89C9;&#x795E;&#x6E05;&#x6C14;&#x723D;&#xFF0C;&#x8EAB;&#x5FC3;&#x8212;&#x7545;&#x3002;</p>
<p>  &#x8FD9;&#x65F6;&#xFF0C;&#x674E;&#x840D;&#x548C;&#x79CB;&#x6708;&#x4E5F;&#x4ECE;&#x5916;&#x9762;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x770B;&#x5230;&#x9646;&#x9E23;&#xFF0C;&#x4E24;&#x4EBA;&#x90FD;&#x5F88;&#x8BE7;&#x5F02;&#x7684;&#x76EF;&#x7740;&#x9646;&#x9E23;&#x3002;</p>
<p>  &#x73B0;&#x5728;&#xFF0C;&#x9646;&#x9E23;&#x7CBE;&#x6C14;&#x9971;&#x6EE1;&#xFF0C;&#x548C;&#x4EE5;&#x5F80;&#x4F53;&#x5F31;&#x591A;&#x75C5;&#x7684;&#x5F62;&#x8C61;&#x76F8;&#x5DEE;&#x751A;&#x8FDC;&#xFF0C;&#x96BE;&#x602A;&#x4E24;&#x4EBA;&#x4F1A;&#x8BE7;&#x5F02;&#x4E86;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x7684;&#x4F24;&#x597D;&#x4E9B;&#x4E86;&#x5417;&#xFF1F;&#x201D;&#x674E;&#x840D;&#x4ED4;&#x4ED4;&#x7EC6;&#x7EC6;&#x7684;&#x6253;&#x91CF;&#x7740;&#x9646;&#x9E23;&#xFF0C;&#x95EE;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x662F;&#x554A;&#xFF0C;&#x516C;&#x5B50;&#xFF0C;&#x4F60;&#x548C;&#x4EE5;&#x524D;&#x597D;&#x50CF;&#x6709;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#x5462;&#x3002;&#x201D;&#x79CB;&#x6708;&#x4E5F;&#x7728;&#x5DF4;&#x7740;&#x5927;&#x773C;&#x775B;&#x95EE;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E00;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x5A18;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x6B21;&#x53D7;&#x4F24;&#x540E;&#xFF0C;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x4FEE;&#x70BC;&#x300A;&#x805A;&#x6C14;&#x529F;&#x300B;&#xFF0C;&#x5C45;&#x7136;&#x4FEE;&#x70BC;&#x51FA;&#x4E00;&#x7F15;&#x771F;&#x6C14;&#xFF0C;&#x6240;&#x4EE5;&#x8EAB;&#x4F53;&#x624D;&#x597D;&#x4E00;&#x70B9;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x4EC0;&#x4E48;&#xFF1F;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x4FEE;&#x70BC;&#x51FA;&#x771F;&#x6C14;&#x4E86;?&#x201D;&#x95FB;&#x8A00;&#xFF0C;&#x674E;&#x840D;&#x72C2;&#x559C;&#xFF0C;&#x773C;&#x6CEA;&#x5728;&#x773C;&#x4E2D;&#x6253;&#x8F6C;&#xFF0C;&#x90A3;&#x662F;&#x9AD8;&#x5174;&#x7684;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x674E;&#x840D;&#x5173;&#x4E8E;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x91CC;&#x9762;&#x53EF;&#x662F;&#x6709;&#x7740;&#x795E;&#x7EA7;&#x529F;&#x6CD5;&#xFF0C;&#x4E07;&#x4E00;&#x4F20;&#x51FA;&#x53BB;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E09;&#x4EBA;&#x5C06;&#x6709;&#x5927;&#x7978;&#x3002;</p>
<p>  &#x4F46;&#x4ED6;&#x541E;&#x566C;&#x6D17;&#x9AD3;&#x4E39;&#xFF0C;&#x8EAB;&#x4F53;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x6CA1;&#x6709;&#x4E2A;&#x8BF4;&#x6CD5;&#xFF0C;&#x674E;&#x840D;&#x4ED6;&#x4EEC;&#x96BE;&#x514D;&#x4F1A;&#x5947;&#x602A;&#x3002;</p>
<p>  &#x6240;&#x4EE5;&#xFF0C;&#x4ED6;&#x624D;&#x900F;&#x9732;&#x4E00;&#x70B9;&#xFF0C;&#x4ED6;&#x4FEE;&#x70BC;&#x51FA;&#x771F;&#x6C14;&#x4E86;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x513F;&#xFF0C;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x592A;&#x597D;&#x4E86;&#x3002;&#x201D;&#x674E;&#x840D;&#x6FC0;&#x52A8;&#x7684;&#x70ED;&#x6CEA;&#x76C8;&#x7736;&#x3002;</p>
<p>  &#x867D;&#x7136;&#xFF0C;&#x53EA;&#x662F;&#x4FEE;&#x70BC;&#x51FA;&#x771F;&#x6C14;&#x800C;&#x5DF2;&#xFF0C;&#x8FDE;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x6B66;&#x8005;&#x90FD;&#x7B97;&#x4E0D;&#x4E0A;&#xFF0C;&#x66F4;&#x52A0;&#x4E0D;&#x7528;&#x8BF4;&#x548C;&#x8840;&#x8109;&#x6B66;&#x8005;&#x6BD4;&#x4E86;&#xFF0C;&#x4F46;&#x5979;&#x4F9D;&#x7136;&#x5341;&#x5206;&#x9AD8;&#x5174;&#xFF0C;&#x4E3A;&#x9646;&#x9E23;&#x9AD8;&#x5174;&#x3002;</p>
<p>  &#x201C;&#x5C11;&#x7237;&#xFF0C;&#x90A3;&#x4F60;&#x4EE5;&#x540E;&#x53EF;&#x8981;&#x4FDD;&#x62A4;&#x592B;&#x4EBA;&#x548C;&#x6211;&#x4E86;&#x3002;&#x201D;&#x79CB;&#x6708;&#x4E5F;&#x9732;&#x51FA;&#x5F00;&#x5FC3;&#x7684;&#x7B11;&#x5BB9;&#x3002;</p>
<p>  &#x63A5;&#x7740;&#xFF0C;&#x674E;&#x840D;&#x548C;&#x79CB;&#x6708;&#x5F00;&#x59CB;&#x716E;&#x996D;&#xFF0C;&#x5F88;&#x5FEB;&#xFF0C;&#x5C31;&#x9999;&#x5473;&#x6251;&#x9F3B;&#x4E86;&#x3002;</p>
<p>  &#x4E09;&#x4E2A;&#x4EBA;&#x6B22;&#x559C;&#x7684;&#x5750;&#x5728;&#x4E00;&#x8D77;&#x5403;&#x996D;&#x3002;</p>
<p>  &#x83DC;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E00;&#x8364;&#x4E24;&#x7D20;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x4F24;&#x52BF;&#x8FD8;&#x6CA1;&#x597D;&#xFF0C;&#x8089;&#x4F60;&#x591A;&#x5403;&#x70B9;&#xFF0C;&#x8865;&#x5145;&#x6C14;&#x8840;&#x3002;&#x201D;&#x674E;&#x840D;&#x4E00;&#x4E2A;&#x52B2;&#x7684;&#x5F80;&#x9646;&#x9E23;&#x7897;&#x91CC;&#x5939;&#x8089;&#x3002;</p>
<p>  &#x201C;&#x5A18;&#xFF0C;&#x79CB;&#x6708;&#xFF0C;&#x4F60;&#x4EEC;&#x4E5F;&#x5403;&#x3002;&#x201D;&#x9646;&#x9E23;&#x9053;&#x3002;</p>
<p>  &#x81EA;&#x4ECE;&#x9646;&#x9E23;&#x7684;&#x7236;&#x4EB2;&#x9646;&#x4E91;&#x5929;&#x4F20;&#x51FA;&#x88AB;&#x4EBA;&#x51FB;&#x6740;&#x7684;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x8FD9;&#x516D;&#x5E74;&#x6765;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BCD;&#x5B50;&#x7684;&#x751F;&#x6D3B;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x5DEE;&#xFF0C;&#x65CF;&#x4E2D;&#x7ED9;&#x7684;&#x4F8B;&#x94B1;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x5E73;&#x65F6;&#x5F88;&#x5C11;&#x6709;&#x8089;&#x5403;&#x7684;&#x3002;</p>
<p>  &#x5C31;&#x7B97;&#x5076;&#x5C14;&#x6709;&#xFF0C;&#x674E;&#x840D;&#x548C;&#x79CB;&#x6708;&#x4E5F;&#x90FD;&#x662F;&#x8BA9;&#x7ED9;&#x9646;&#x9E23;&#x5403;&#xFF0C;&#x800C;&#x79CB;&#x6708;&#x66F4;&#x662F;&#xFF0C;&#x6B63;&#x5728;&#x957F;&#x8EAB;&#x4F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8425;&#x517B;&#x8DDF;&#x4E0D;&#x4E0A;&#xFF0C;&#x663E;&#x5F97;&#x6709;&#x4E9B;&#x7626;&#x5F31;&#x3002;</p>
<p>  &#x6B66;&#x8005;&#x4FEE;&#x70BC;&#xFF0C;&#x9700;&#x8981;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x7684;&#x80FD;&#x91CF;&#xFF0C;&#x5BF9;&#x4E8E;&#x5403;&#xFF0C;&#x4E5F;&#x76F8;&#x5BF9;&#x8981;&#x8BB2;&#x7A76;&#x4E00;&#x4E9B;&#x3002;</p>
<p>  &#x9646;&#x5BB6;&#x7684;&#x90A3;&#x4E9B;&#x89C9;&#x9192;&#x8840;&#x8109;&#x7684;&#x6B66;&#x8005;&#xFF0C;&#x5403;&#x7684;&#x90A3;&#x53EF;&#x4E0D;&#x662F;&#x666E;&#x901A;&#x731B;&#x517D;&#x7684;&#x8089;&#xFF0C;&#x800C;&#x662F;&#x5996;&#x517D;&#x7684;&#x8089;&#x3002;</p>
<p>  &#x751A;&#x81F3;&#x90A3;&#x4E9B;&#x5929;&#x8D4B;&#x9AD8;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x5996;&#x517D;&#x8089;&#x4E4B;&#x5916;&#xFF0C;&#x6BCF;&#x5929;&#x8FD8;&#x541E;&#x98DF;&#x4EE5;&#x5996;&#x517D;&#x8840;&#x6DB2;&#xFF0C;&#x9AA8;&#x7C89;&#xFF0C;&#x52A0;&#x4E0A;&#x5404;&#x79CD;&#x540D;&#x8D35;&#x836F;&#x6750;&#x70BC;&#x5236;&#x7684;&#x9F99;&#x864E;&#x4E39;&#x3002;</p>
<p>  &#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x8574;&#x542B;&#x5F3A;&#x5927;&#x7684;&#x7CBE;&#x6C14;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x5F3A;&#x5065;&#x6B66;&#x8005;&#x7684;&#x808C;&#x8089;&#xFF0C;&#x9AA8;&#x9ABC;&#xFF0C;&#x7ECF;&#x8109;&#xFF0C;&#x810F;&#x8151;&#xFF0C;&#x751A;&#x81F3;&#x80FD;&#x8F6C;&#x4E3A;&#x771F;&#x6C14;&#xFF0C;&#x5E2E;&#x52A9;&#x4FEE;&#x70BC;&#xFF0C;&#x63D0;&#x5347;&#x4FEE;&#x4E3A;&#x3002;</p>
<p>  &#x50CF;&#x9646;&#x9E23;&#x8FD9;&#x6837;&#x5403;&#xFF0C;&#x8425;&#x517B;&#x5176;&#x5B9E;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x7684;&#x3002;</p>
<p>  &#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x7EC3;&#x51FA;&#x4E86;&#x771F;&#x6C14;&#xFF0C;&#x5403;&#x8FD9;&#x4E9B;&#x996D;&#x83DC;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x5A18;&#x8FD9;&#x91CC;&#x6709;&#x516B;&#x9897;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4F60;&#x62FF;&#x53BB;&#x4FEE;&#x70BC;&#x5427;&#x3002;&#x201D;</p>
<p>  &#x674E;&#x840D;&#x5C0F;&#x5FC3;&#x7684;&#x62FF;&#x51FA;&#x4E00;&#x4E2A;&#x74F6;&#x5B50;&#xFF0C;&#x9012;&#x7ED9;&#x9646;&#x9E23;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E00;&#x6123;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x674E;&#x840D;&#x80FD;&#x62FF;&#x51FA;&#x516B;&#x9897;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x7591;&#x60D1;&#x7684;&#x9053;&#xFF1A;&#x201C;&#x5A18;&#xFF0C;&#x9F99;&#x864E;&#x4E39;&#x53EF;&#x662F;&#x9700;&#x8981;&#x4E00;&#x767E;&#x4E24;&#x94F6;&#x5B50;&#x4E00;&#x9897;&#xFF0C;&#x4F60;&#x54EA;&#x91CC;&#x7684;&#x90A3;&#x4E48;&#x94F6;&#x5B50;&#x554A;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x5A18;&#x81EA;&#x7136;&#x6709;&#x529E;&#x6CD5;&#x7684;&#xFF0C;&#x672C;&#x6765;&#x662F;&#x4E70;&#x7ED9;&#x4F60;&#x5F3A;&#x8EAB;&#x5065;&#x4F53;&#x7528;&#x7684;&#xFF0C;&#x6B63;&#x597D;&#x4F60;&#x80FD;&#x4FEE;&#x70BC;&#x771F;&#x6C14;&#xFF0C;&#x521A;&#x597D;&#x7684;&#x7528;&#x7684;&#x4E0A;&#x3002;&#x201D;&#x674E;&#x840D;&#x7B11;&#x4E86;&#x7B11;&#x3002;</p>
<p>  &#x201C;&#x516C;&#x5B50;&#xFF0C;&#x592B;&#x4EBA;&#x662F;&#x5356;&#x6389;&#x4E86;&#x9F99;&#x51E4;&#x956F;&#xFF0C;&#x624D;&#x4E70;&#x4E86;&#x8FD9;&#x516B;&#x9897;&#x9F99;&#x864E;&#x4E39;&#x7684;&#x3002;&#x201D;&#x79CB;&#x6708;&#x4F3C;&#x4E4E;&#x6709;&#x4E9B;&#x770B;&#x4E0D;&#x4E0B;&#x53BB;&#xFF0C;&#x63A5;&#x8BDD;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x79CB;&#x6708;&#xFF01;&#x201D;&#x674E;&#x840D;&#x8F7B;&#x53EB;&#x4E86;&#x4E00;&#x58F0;&#xFF0C;&#x4F3C;&#x4E4E;&#x602A;&#x79CB;&#x6708;&#x591A;&#x8BDD;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9E23;&#x513F;&#xFF0C;&#x4F60;&#x653E;&#x5FC3;&#x4FEE;&#x70BC;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x4FEE;&#x70BC;&#x771F;&#x6C14;&#xFF0C;&#x5F3A;&#x8EAB;&#x5065;&#x4F53;&#xFF0C;&#x4E00;&#x4E2A;&#x9F99;&#x51E4;&#x956F;&#x7B97;&#x7684;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x5A18;...&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x9F3B;&#x5B50;&#x6709;&#x4E9B;&#x53D1;&#x9178;&#xFF0C;&#x53CC;&#x624B;&#x7D27;&#x7D27;&#x7684;&#x5C06;&#x9F99;&#x864E;&#x4E39;&#x7684;&#x74F6;&#x5B50;&#x63E1;&#x4F4F;&#x3002;</p>
<p>  &#x9F99;&#x51E4;&#x956F;&#xFF0C;&#x4E43;&#x662F;&#x5F53;&#x5E74;&#x9646;&#x4E91;&#x5929;&#x9001;&#x7ED9;&#x674E;&#x840D;&#x7684;&#x5B9A;&#x60C5;&#x4FE1;&#x7269;&#xFF0C;&#x9646;&#x9E23;&#x77E5;&#x9053;&#x674E;&#x840D;&#x5C06;&#x9F99;&#x51E4;&#x956F;&#x770B;&#x7684;&#x6709;&#x591A;&#x91CD;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x4E3A;&#x4E86;&#x9646;&#x9E23;&#x7684;&#x8EAB;&#x4F53;&#xFF0C;&#x674E;&#x840D;&#x628A;&#x9F99;&#x51E4;&#x956F;&#x5356;&#x6389;&#x4E86;&#x3002;</p>
<p>  &#x201C;&#x5A18;&#xFF0C;&#x4F60;&#x653E;&#x5FC3;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x5F3A;&#x8005;&#xFF0C;&#x7528;&#x6211;&#x7684;&#x529B;&#x91CF;&#x4FDD;&#x62A4;&#x4F60;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x8BA9;&#x4F60;&#x53D7;&#x4E00;&#x70B9;&#x59D4;&#x5C48;&#x3002;&#x201D;&#x9646;&#x9E23;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x53D1;&#x8A93;&#xFF0C;&#x76EE;&#x5149;&#x65E0;&#x6BD4;&#x7684;&#x575A;&#x5B9A;&#x3002;</p>
<p>  &#x5403;&#x5B8C;&#x996D;&#xFF0C;&#x9646;&#x9E23;&#x62FF;&#x7740;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4FBF;&#x56DE;&#x5230;&#x4E86;&#x623F;&#x95F4;&#xFF0C;&#x8FDB;&#x5165;&#x5230;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#x3002;</p>
<p>  &#x4E00;&#x8FDB;&#x5165;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#xFF0C;&#x9646;&#x9E23;&#x4FBF;&#x628A;&#x76EE;&#x5149;&#x6295;&#x5411;&#x4E86;&#x4E5D;&#x5341;&#x4E5D;&#x9636;&#x68AF;&#x4E4B;&#x4E0A;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5E73;&#x53F0;&#x3002;</p>
<p>  &#x56E0;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x9762;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x7BB1;&#x5B50;&#xFF0C;&#x800C;&#x4E14;&#x6210;&#x9752;&#x94DC;&#x8272;&#x3002;</p>
<p>  &#x7B2C;&#x4E00;&#x4E2A;&#x9ED1;&#x94C1;&#x7BB1;&#x5B50;&#x4E2D;&#xFF0C;&#x90FD;&#x6709;&#x300A;&#x6218;&#x9F99;&#x771F;&#x8BC0;&#x300B;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x300A;&#x708E;&#x9F99;&#x62F3;&#x300B;&#x300A;&#x9F99;&#x86C7;&#x6B65;&#x6CD5;&#x300B;&#x8FD8;&#x6709;&#x6D17;&#x9AD3;&#x4E39;&#xFF0C;&#x90A3;&#x7B2C;&#x4E8C;&#x4E2A;&#x7BB1;&#x5B50;&#x6709;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>  &#x9646;&#x9E23;&#x65E0;&#x6BD4;&#x597D;&#x5947;&#xFF0C;&#x5411;&#x7740;&#x9636;&#x68AF;&#x8D70;&#x53BB;&#x3002;</p>
<p>  &#x4F46;&#x4ED6;&#x8D70;&#x5230;&#x7B2C;&#x4E5D;&#x5341;&#x4E5D;&#x4E2A;&#x9636;&#x68AF;&#xFF0C;&#x60F3;&#x767B;&#x4E0A;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EBA;&#x5E73;&#x53F0;&#xFF0C;&#x5374;&#x600E;&#x4E48;&#x4E5F;&#x767B;&#x4E0D;&#x4E0A;&#x53BB;&#xFF0C;&#x90A3;&#x91CC;&#x6709;&#x4E00;&#x80A1;&#x65E0;&#x5F62;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x963B;&#x6321;&#x4F4F;&#x4ED6;&#x3002;</p>
<p>  &#x201C;&#x96BE;&#x9053;&#x662F;&#x6211;&#x4FEE;&#x4E3A;&#x4E0D;&#x591F;&#x7684;&#x7F18;&#x6545;&#xFF1F;&#x201D;&#x9646;&#x9E23;&#x65E0;&#x5948;&#xFF0C;&#x53EA;&#x80FD;&#x9000;&#x4E86;&#x56DE;&#x53BB;&#x3002;</p>
<p>  &#x968F;&#x540E;&#x76D8;&#x819D;&#x800C;&#x5750;&#xFF0C;&#x5012;&#x51FA;&#x4E00;&#x9897;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x541E;&#x5165;&#x53E3;&#x4E2D;&#xFF0C;&#x5F00;&#x59CB;&#x4FEE;&#x70BC;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x800C;&#x5F53;&#x9646;&#x9E23;&#x541E;&#x4E0B;&#x9F99;&#x864E;&#x4E39;&#x4E4B;&#x540E;&#xFF0C;&#x810A;&#x690E;&#x5904;&#x7A81;&#x7136;&#x4E00;&#x70ED;&#xFF0C;&#x4E00;&#x80A1;&#x5F3A;&#x5927;&#x7684;&#x5438;&#x5F15;&#x529B;&#x4EA7;&#x751F;&#xFF0C;&#x5C06;&#x9F99;&#x864E;&#x4E39;&#x7684;&#x836F;&#x529B;&#x5168;&#x90E8;&#x5438;&#x6536;&#x8FDB;&#x53BB;&#xFF0C;&#x968F;&#x540E;&#xFF0C;&#x4E00;&#x80A1;&#x80A1;&#x7CBE;&#x7EAF;&#x7684;&#x80FD;&#x91CF;&#x4ECE;&#x810A;&#x690E;&#x5904;&#x6D8C;&#x51FA;&#x3002;</p>
<p>  &#x201C;&#x8FD9;&#x4E48;&#x5FEB;&#xFF1F;&#x201D;&#x9646;&#x9E23;&#x5148;&#x662F;&#x4E00;&#x60CA;&#xFF0C;&#x63A5;&#x7740;&#x72C2;&#x559C;&#x3002;</p>
<p>  &#x4E00;&#x822C;&#x4EBA;&#xFF0C;&#x60F3;&#x8981;&#x70BC;&#x5316;&#x4E00;&#x9897;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x8D77;&#x7801;&#x9700;&#x8981;&#x4E00;&#x5929;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x4ED6;&#x9877;&#x523B;&#x95F4;&#x5C31;&#x5B8C;&#x5168;&#x70BC;&#x5316;&#x4E86;&#x3002;</p>
<p>  &#x662F;&#x56E0;&#x4E3A;&#x90A3;&#x8FD8;&#x6CA1;&#x751F;&#x957F;&#x51FA;&#x6765;&#x7684;&#x8840;&#x8109;&#x3002;</p>
<p>  &#x8FD9;&#x8FD8;&#x6CA1;&#x751F;&#x957F;&#x51FA;&#x6765;&#x7684;&#x8840;&#x8109;&#x771F;&#x662F;&#x795E;&#x5947;&#xFF0C;&#x4E0D;&#x4EC5;&#x5438;&#x6536;&#x5929;&#x5730;&#x7075;&#x6C14;&#x7684;&#x901F;&#x5EA6;&#x76F8;&#x5F53;&#x4E8E;&#x4E8C;&#x7EA7;&#x8840;&#x8109;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x6709;&#x5FEB;&#x901F;&#x70BC;&#x5316;&#x4E39;&#x836F;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>  &#x201C;&#x597D;&#xFF0C;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x51B2;&#x51FB;&#x7ECF;&#x8109;&#x3002;&#x201D;&#x968F;&#x5373;&#xFF0C;&#x9646;&#x9E23;&#x6536;&#x655B;&#x5FC3;&#x795E;&#xFF0C;&#x8FD0;&#x8F6C;&#x300A;&#x6218;&#x9F99;&#x771F;&#x8BC0;&#x300B;&#xFF0C;&#x5F00;&#x59CB;&#x51B2;&#x51FB;&#x4E09;&#x6761;&#x2018;&#x4EBA;&#x8109;&#x2019;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x3002;</p>
<p>  &#x6EDA;&#x6EDA;&#x7684;&#x80FD;&#x91CF;&#x88AB;&#x9646;&#x9E23;&#x64CD;&#x63A7;&#x7740;&#xFF0C;&#x5411;&#x7740;&#x7B2C;&#x4E00;&#x6761;&#x7ECF;&#x8109;&#x51B2;&#x53BB;&#x3002;</p>
<p>  &#x8F70;&#xFF01;&#x8F70;&#xFF01;...</p>
<p>  &#x8EAB;&#x4F53;&#x4E2D;&#x597D;&#x50CF;&#x54CD;&#x8D77;&#x4E86;&#x9635;&#x9635;&#x8F70;&#x9E23;&#x58F0;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x7684;&#x7A74;&#x9053;&#x88AB;&#x51B2;&#x5F00;&#x3002;</p>
<p>  &#x5F53;&#x80FD;&#x91CF;&#x4E0D;&#x591F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9646;&#x9E23;&#x53C8;&#x541E;&#x4E0B;&#x4E86;&#x4E00;&#x9897;&#x9F99;&#x864E;&#x4E39;&#x3002;</p>
<p>  &#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x5F53;&#x508D;&#x665A;&#x6765;&#x4E34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x516B;&#x9897;&#x9F99;&#x864E;&#x4E39;&#x5DF2;&#x7ECF;&#x5168;&#x90E8;&#x6D88;&#x8017;&#x5B8C;&#xFF0C;&#x800C;&#x9646;&#x9E23;&#x4E5F;&#x51ED;&#x501F;&#x516B;&#x9897;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x6210;&#x529F;&#x4E86;&#x6253;&#x901A;&#x4E86;&#x4E09;&#x6761;&#x2018;&#x4EBA;&#x8109;&#x2019;&#x3002;</p>
<p>  &#x901A;&#x8109;&#x5C42;&#x6B21;&#xFF0C;&#x5206;&#x4E3A;&#x524D;&#x671F;&#xFF0C;&#x4E2D;&#x671F;&#xFF0C;&#x540E;&#x671F;&#x3002;</p>
<p>  &#x6253;&#x901A;&#x4E00;&#x5230;&#x4E09;&#x6761;&#x4EBA;&#x8109;&#xFF0C;&#x4E3A;&#x901A;&#x8109;&#x524D;&#x671F;&#xFF0C;&#x56DB;&#x5230;&#x516D;&#x6761;&#x5730;&#x8109;&#xFF0C;&#x4E3A;&#x901A;&#x8109;&#x4E2D;&#x671F;...</p>
<p>  &#x901A;&#x8109;&#x5883;&#xFF0C;&#x662F;&#x6B66;&#x8005;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x7684;&#x3002;</p>
<p>  &#x5F53;&#x7136;&#xFF0C;&#x5BB9;&#x6613;&#x4E5F;&#x662F;&#x56E0;&#x4EBA;&#x800C;&#x5F02;&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x7684;&#x8840;&#x8109;&#x6B66;&#x8005;&#xFF0C;&#x77ED;&#x5219;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x591A;&#x5219;&#x4E00;&#x5E74;&#xFF0C;&#x80AF;&#x5B9A;&#x80FD;&#x5C06;&#x4E5D;&#x6761;&#x7ECF;&#x8109;&#x5168;&#x90E8;&#x6253;&#x901A;&#x3002;</p>
<p>  &#x4F46;&#x666E;&#x901A;&#x6B66;&#x8005;&#xFF0C;&#x5C31;&#x4E0D;&#x4E00;&#x5B9A;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4E00;&#x8F88;&#x5B50;&#x4E5F;&#x4E0D;&#x80FD;&#x6253;&#x901A;&#x4E5D;&#x6761;&#x7ECF;&#x8109;&#x3002;</p>
<p>  &#x4E0D;&#x8FC7;&#x50CF;&#x9646;&#x9E23;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0B;&#x5348;&#x5C31;&#x6253;&#x901A;&#x4E86;&#x4E09;&#x6761;&#x7ECF;&#x8109;&#x7684;&#xFF0C;&#x90A3;&#x662F;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#x4E86;&#xFF0C;&#x8981;&#x662F;&#x4F20;&#x51FA;&#x53BB;&#xFF0C;&#x7EDD;&#x5BF9;&#x8981;&#x8BA9;&#x4EBA;&#x76EE;&#x77AA;&#x53E3;&#x5446;&#x3002;</p>
<p>  &#x8FD9;&#x548C;&#x300A;&#x6218;&#x9F99;&#x771F;&#x8BC0;&#x300B;&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x6CA1;&#x957F;&#x6210;&#x7684;&#x8840;&#x8109;&#x7684;&#x5947;&#x7279;&#x6027;&#x8D28;&#xFF0C;&#x662F;&#x5206;&#x4E0D;&#x5F00;&#x7684;&#x3002;</p>
<p>  &#x6218;&#x9F99;&#x771F;&#x8BC0;&#xFF0C;&#x4E43;&#x662F;&#x795E;&#x7EA7;&#x529F;&#x6CD5;&#xFF0C;&#x90A3;&#x672A;&#x751F;&#x957F;&#x7684;&#x8840;&#x8109;&#xFF0C;&#x66F4;&#x662F;&#x80FD;&#x77AC;&#x95F4;&#x70BC;&#x5316;&#x4E39;&#x836F;&#xFF0C;&#x8FD9;&#x624D;&#x6210;&#x5C31;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5947;&#x8FF9;&#x3002;</p>
<p>  &#x611F;&#x53D7;&#x7740;&#x4F53;&#x5185;&#x7684;&#x6218;&#x9F99;&#x771F;&#x6C14;&#x5728;&#x4E09;&#x6761;&#x7ECF;&#x8109;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x9646;&#x9E23;&#x5145;&#x6EE1;&#x4E86;&#x559C;&#x60A6;&#x548C;&#x6597;&#x5FD7;&#x3002;</p>
<p>  &#x5403;&#x8FC7;&#x665A;&#x996D;&#x540E;&#xFF0C;&#x9646;&#x9E23;&#x53C8;&#x6025;&#x5306;&#x5306;&#x7684;&#x8FDB;&#x5165;&#x5230;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#xFF0C;&#x5F00;&#x59CB;&#x4FEE;&#x70BC;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x73B0;&#x5728;&#xFF0C;&#x4ED6;&#x6253;&#x7B97;&#x4FEE;&#x70BC;&#x6B66;&#x6280;&#x300A;&#x708E;&#x9F99;&#x62F3;&#x300B;&#x3002;</p>
<p>  &#x6B66;&#x6280;&#xFF0C;&#x7531;&#x771F;&#x6C14;&#x5E26;&#x52A8;&#x8EAB;&#x4F53;&#x7684;&#x7B4B;&#x8089;&#xFF0C;&#x9AA8;&#x9ABC;&#xFF0C;&#x53D1;&#x51FA;&#x7684;&#x653B;&#x51FB;&#x3002;</p>
<p>  &#x4E0D;&#x540C;&#x7684;&#x6B66;&#x6280;&#xFF0C;&#x771F;&#x6C14;&#x8FD0;&#x884C;&#xFF0C;&#x808C;&#x8089;&#x9AA8;&#x9ABC;&#x8FD0;&#x8F6C;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6B66;&#x6280;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x9020;&#x6210;&#x7684;&#x62DB;&#x5F0F;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5A01;&#x529B;&#x4E5F;&#x5929;&#x5DEE;&#x5730;&#x522B;&#x3002;</p>
<p>  &#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x5BF9;&#x771F;&#x6C14;&#x7684;&#x638C;&#x63A7;&#xFF0C;&#x5BF9;&#x4E8E;&#x8EAB;&#x4F53;&#x7684;&#x638C;&#x63A7;&#xFF0C;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#xFF0C;&#x975E;&#x957F;&#x5E74;&#x7D2F;&#x6708;&#x7684;&#x8F9B;&#x82E6;&#x4FEE;&#x70BC;&#xFF0C;&#x662F;&#x5F88;&#x96BE;&#x5C06;&#x4E00;&#x95E8;&#x6B66;&#x6280;&#x4FEE;&#x70BC;&#x5230;&#x5BB6;&#x7684;&#x3002;</p>
<p>  &#x8D8A;&#x662F;&#x9AD8;&#x7EA7;&#x7684;&#x6B66;&#x6280;&#xFF0C;&#x5BF9;&#x4E8E;&#x771F;&#x6C14;&#xFF0C;&#x6295;&#x8EAB;&#x7684;&#x64CD;&#x63A7;&#x5C31;&#x8D8A;&#x96BE;&#xFF0C;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5F53;&#x7136;&#x5A01;&#x529B;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6446;&#x5F00;&#x67B6;&#x52BF;&#xFF0C;&#x5F00;&#x59CB;&#x4FEE;&#x70BC;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x4E0A;&#x65B9;&#xFF0C;&#x5BAB;&#x6BBF;&#x4E2D;&#x7684;&#x8BF5;&#x7ECF;&#x58F0;&#x4E0D;&#x65AD;&#x4F20;&#x51FA;&#xFF0C;&#x8BA9;&#x9646;&#x9E23;&#x7684;&#x8111;&#x888B;&#x65E0;&#x6BD4;&#x7684;&#x6E05;&#x6670;&#xFF0C;&#x5173;&#x4E8E;&#x300A;&#x708E;&#x9F99;&#x62F3;&#x300B;&#x4E00;&#x4E9B;&#x8BC0;&#x7A8D;&#xFF0C;&#x4E0D;&#x65AD;&#x5728;&#x8111;&#x4E2D;&#x95EA;&#x73B0;&#x3002;</p>
<p>  &#x771F;&#x6C14;&#x8FD0;&#x8F6C;&#xFF0C;&#x6D8C;&#x5165;&#x53CC;&#x811A;&#xFF0C;&#x968F;&#x540E;&#x5E26;&#x52A8;&#x53CC;&#x811A;&#x7684;&#x9AA8;&#x9ABC;&#x3001;&#x808C;&#x8089;&#x3002;</p>
<p>  &#x201C;&#x559D;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x4E00;&#x58F0;&#x8F7B;&#x559D;&#xFF0C;&#x53CC;&#x811A;&#x5411;&#x524D;&#x4E00;&#x8E0F;&#xFF0C;&#x529B;&#x91CF;&#x4ECE;&#x53CC;&#x811A;&#x6D8C;&#x5165;&#x8170;&#x95F4;&#x810A;&#x690E;&#xFF0C;&#x810A;&#x690E;&#x4E00;&#x626D;&#xFF0C;&#x5982;&#x4E00;&#x6761;&#x5927;&#x9F99;&#x4E00;&#x822C;&#xFF0C;&#x4E00;&#x80A1;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x7684;&#x529B;&#x91CF;&#x4ECE;&#x8170;&#x95F4;&#x6D8C;&#x5411;&#x53CC;&#x624B;&#x3002;</p>
<p>  &#x8F70;&#xFF01;</p>
<p>  &#x9646;&#x9E23;&#x4E00;&#x62F3;&#x8F70;&#x51FA;&#xFF0C;&#x529B;&#x91CF;&#x7206;&#x53D1;&#x800C;&#x51FA;&#xFF0C;&#x9707;&#x7684;&#x7A7A;&#x6C14;&#x8F70;&#x9E23;&#x70B8;&#x54CD;&#x3002;</p>
<p>  &#x201C;&#x521D;&#x7AA5;&#x95E8;&#x5F84;&#xFF01;&#x201D;&#x9646;&#x9E23;&#x773C;&#x4E2D;&#x95EA;&#x8FC7;&#x60CA;&#x559C;&#x4E4B;&#x8272;&#x3002;</p>
<p>  &#x6B66;&#x6280;&#x7684;&#x4FEE;&#x70BC;&#xFF0C;&#x6839;&#x636E;&#x706B;&#x5019;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5206;&#x4E3A;&#x4E86;&#x516D;&#x4E2A;&#x5C42;&#x6B21;&#x3002;</p>
<p>  &#x521D;&#x7AA5;&#x95E8;&#x5F84;&#xFF0C;&#x7565;&#x6709;&#x5C0F;&#x6210;&#xFF0C;&#x878D;&#x4F1A;&#x8D2F;&#x901A;&#xFF0C;&#x7089;&#x706B;&#x7EAF;&#x9752;&#xFF0C;&#x51FA;&#x795E;&#x5165;&#x5316;&#xFF0C;&#x4EBA;&#x6B66;&#x5408;&#x4E00;&#x3002;</p>
<p>  &#x516D;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x4E2A;&#x811A;&#x5370;&#xFF0C;&#x96BE;&#x4EE5;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#xFF0C;&#x6B66;&#x6280;&#x7684;&#x7B49;&#x7EA7;&#x8D8A;&#x9AD8;&#xFF0C;&#x8D8A;&#x96BE;&#x4EE5;&#x63D0;&#x5347;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6CA1;&#x60F3;&#x5230;&#xFF0C;&#x4ED6;&#x7B2C;&#x4E00;&#x6B21;&#x5F00;&#x59CB;&#x4FEE;&#x70BC;&#x300A;&#x708E;&#x9F99;&#x62F3;&#x300B;&#xFF0C;&#x5C31;&#x80FD;&#x8FBE;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x521D;&#x7AA5;&#x95E8;&#x5F84;&#x3002;</p>
<p>  &#x8FD9;&#x662F;&#x9EC4;&#x7EA7;&#x4E0B;&#x54C1;&#x6B66;&#x6280;&#xFF0C;&#x8981;&#x662F;&#x4E00;&#x822C;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x662F;&#x96BE;&#x4EE5;&#x6478;&#x5230;&#x95E8;&#x9053;&#x7684;&#x3002;</p>
<p>  &#x201C;&#x90A3;&#x5BAB;&#x6BBF;&#x4E2D;&#x8BF5;&#x7ECF;&#x58F0;&#xFF0C;&#x5BF9;&#x6211;&#x4FEE;&#x70BC;&#x6B66;&#x6280;&#x7684;&#x5E2E;&#x52A9;&#x5F88;&#x5927;&#x554A;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x770B;&#x7740;&#x9636;&#x68AF;&#x6DF1;&#x5904;&#x7684;&#x5BAB;&#x6BBF;&#xFF0C;&#x5FC3;&#x91CC;&#x601D;&#x7D22;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x63A8;&#x6D4B;&#xFF0C;&#x4ED6;&#x4E4B;&#x6240;&#x4EE5;&#x4FEE;&#x70BC;&#x7684;&#x90A3;&#x4E48;&#x5FEB;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x5C31;&#x662F;&#x90A3;&#x8BF5;&#x7ECF;&#x58F0;&#xFF0C;&#x8FD8;&#x6709;&#xFF0C;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x609F;&#x6027;&#xFF0C;&#x6050;&#x6015;&#x4E5F;&#x5F88;&#x4E0D;&#x5F31;&#x3002;&#x65E2;&#x7136;&#x6709;&#x5982;&#x6B64;&#x529F;&#x6548;&#xFF0C;&#x9646;&#x9E23;&#x81EA;&#x7136;&#x66F4;&#x52A0;&#x62FC;&#x547D;&#x7684;&#x4FEE;&#x70BC;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x6CA1;&#x6709;&#x4E86;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x9646;&#x9E23;&#x6253;&#x901A;&#x7ECF;&#x8109;&#x7684;&#x901F;&#x5EA6;&#x5927;&#x5927;&#x7684;&#x51CF;&#x5F31;&#x4E0B;&#x6765;&#x3002;</p>
<p>  &#x4F46;&#x662F;&#x4E09;&#x5929;&#x540E;&#xFF0C;&#x4ED6;&#x4F9D;&#x7136;&#x6253;&#x901A;&#x4E86;&#x7B2C;&#x56DB;&#x6761;&#x7ECF;&#x8109;&#xFF0C;&#x8FDB;&#x5165;&#x4E86;&#x901A;&#x8109;&#x4E2D;&#x671F;&#x3002;</p>
<p>  &#x800C;&#x300A;&#x708E;&#x9F99;&#x62F3;&#x300B;</p>
<p>  &#x66F4;&#x662F;&#x4FEE;&#x70BC;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x7565;&#x6709;&#x5C0F;&#x6210;&#x3002;</p>
<p>  &#x4E0D;&#x8FC7;&#x8FC7;&#x53BB;&#x4E86;&#x4E09;&#x5929;&#xFF0C;&#x8840;&#x8109;&#x8FD8;&#x662F;&#x6CA1;&#x751F;&#x957F;&#x51FA;&#x6765;&#xFF0C;&#x4F9D;&#x7136;&#x5904;&#x4E8E;&#x7F13;&#x6162;&#x7684;&#x751F;&#x957F;&#x4E2D;&#x3002;</p>
<p>  &#x5FAE;&#x5FAE;&#x4E00;&#x7B11;&#xFF0C;&#x9646;&#x9E23;&#x9000;&#x51FA;&#x4E86;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#xFF0C;&#x8D70;&#x51FA;&#x4E86;&#x623F;&#x95E8;&#x3002;</p>
<p>  &#x4E00;&#x8D70;&#x51FA;&#x623F;&#x95E8;&#xFF0C;&#x5C31;&#x770B;&#x5230;&#x79CB;&#x6708;&#x7EA2;&#x7740;&#x773C;&#x775B;&#xFF0C;&#x4ECE;&#x5916;&#x9762;&#x56DE;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x516C;&#x5B50;&#xFF0C;&#x4F60;&#x53BB;&#x53EB;&#x592B;&#x4EBA;&#x56DE;&#x6765;&#x5427;&#xFF0C;&#x592B;&#x4EBA;&#x5DF2;&#x7ECF;&#x5728;&#x674E;&#x5BB6;&#x8DEA;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x4E86;&#x3002;&#x201D;&#x79CB;&#x6708;&#x5E26;&#x7740;&#x54ED;&#x8154;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x4EC0;&#x4E48;&#xFF1F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF1F;&#x8D70;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x6025;&#x5FD9;&#x548C;&#x79CB;&#x6708;&#x5411;&#x7740;&#x5916;&#x9762;&#x8D70;&#x53BB;&#x3002;</p>
<p>  &#x8DEF;&#x4E0A;&#xFF0C;&#x79CB;&#x6708;&#x544A;&#x8BC9;&#x4E86;&#x9646;&#x9E23;&#x60C5;&#x51B5;&#x3002;</p>
<p>  &#x81EA;&#x4ECE;&#x674E;&#x840D;&#x77E5;&#x9053;&#x9646;&#x9E23;&#x80FD;&#x4FEE;&#x70BC;&#x771F;&#x6C14;&#x540E;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#x5174;&#x3002;</p>
<p>  &#x4F46;&#x662F;&#x4FEE;&#x70BC;&#x6B66;&#x9053;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x529F;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x6B66;&#x6280;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x674E;&#x840D;&#x60F3;&#x5230;&#x9646;&#x5BB6;&#x85CF;&#x4E66;&#x9601;&#xFF0C;&#x4E3A;&#x9646;&#x9E23;&#x79DF;&#x501F;&#x51E0;&#x672C;&#x529F;&#x6CD5;&#x6B66;&#x6280;&#xFF0C;&#x4F46;&#x9646;&#x5BB6;&#x85CF;&#x4E66;&#x9601;&#x7684;&#x5B88;&#x9601;&#x957F;&#x8001;&#x662F;&#x5927;&#x957F;&#x8001;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x53E5;&#x9646;&#x9E23;&#x53EA;&#x662F;&#x5E9F;&#x7269;&#xFF0C;&#x4FBF;&#x6253;&#x53D1;&#x4E86;&#x674E;&#x840D;&#x3002;</p>
<p>  &#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x674E;&#x840D;&#x627E;&#x5230;&#x4E86;&#x9646;&#x5DDD;&#xFF0C;&#x627E;&#x5230;&#x4E86;&#x5927;&#x957F;&#x8001;&#xFF0C;&#x751A;&#x81F3;&#x8DEA;&#x4E0B;&#x6765;&#x6C42;&#x4ED6;&#x4EEC;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x8FDE;&#x4E00;&#x672C;&#x4E0D;&#x5165;&#x6D41;&#x7684;&#x6B66;&#x6280;&#x90FD;&#x6CA1;&#x6709;&#x7ED9;&#x674E;&#x840D;&#x3002;</p>
<p>  &#x8D70;&#x6295;&#x65E0;&#x8DEF;&#x7684;&#x674E;&#x840D;&#xFF0C;&#x627E;&#x5230;&#x4E86;&#x674E;&#x5BB6;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x83B7;&#x5F97;&#x529F;&#x6CD5;&#x6B66;&#x6280;&#x3002;</p>
<p>  &#x674E;&#x5BB6;&#xFF0C;&#x98CE;&#x706B;&#x57CE;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5BB6;&#x65CF;&#xFF0C;&#x674E;&#x840D;&#x7684;&#x5A18;&#x5BB6;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x4E43;&#x662F;&#x674E;&#x840D;&#x7684;&#x5927;&#x54E5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9646;&#x9E23;&#x7684;&#x8205;&#x8205;&#x5F53;&#x5BB6;&#x3002;</p>
<p>  &#x4F46;&#x9646;&#x9E23;&#x7684;&#x8205;&#x8205;&#x4EE5;&#x9646;&#x9E23;&#x662F;&#x9646;&#x5BB6;&#x5B50;&#x5F1F;&#xFF0C;&#x674E;&#x5BB6;&#x4E0D;&#x5B9C;&#x5916;&#x501F;&#x529F;&#x6CD5;&#x6B66;&#x6280;&#x4E3A;&#x7531;&#xFF0C;&#x62D2;&#x7EDD;&#x674E;&#x840D;&#x3002;</p>
<p>  &#x674E;&#x840D;&#x5B9E;&#x5728;&#x65E0;&#x5948;&#xFF0C;&#x53EA;&#x80FD;&#x8DEA;&#x5728;&#x674E;&#x5BB6;&#x5927;&#x5802;&#x4E2D;&#xFF0C;&#x5E0C;&#x671B;&#x6C42;&#x5F97;&#x4E00;&#x672C;&#x6B66;&#x6280;&#x3002;</p>
<p>  &#x201C;&#x8BE5;&#x6B7B;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x5FC3;&#x91CC;&#x6012;&#x543C;&#xFF0C;&#x6012;&#x706B;&#x586B;&#x6EE1;&#x4E86;&#x80F8;&#x95F4;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; ly@cqkjuniversity.com 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-01-06 17:34:11
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.html" class="navigation navigation-prev " aria-label="Previous page: 第二章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4.html" class="navigation navigation-next " aria-label="Next page: 第四章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章","level":"1.5","depth":1,"next":{"title":"第四章","level":"1.6","depth":1,"path":"4.md","ref":"4.md","articles":[]},"previous":{"title":"第二章","level":"1.4","depth":1,"path":"2.md","ref":"2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","chapter-fold","code","splitter","-lunr","-search","search-pro","insert-logo","custom-favicon","pageview-count","tbfed-pagefooter","popup","-sharing","sharing-plus","donate","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy ly@cqkjuniversity.com 2021","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://i.loli.net/2021/01/06/AXCKm6Mp2oxFngb.png","wechatText":"微信"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"./icon/book.ico","back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 30px; min-height: 30px","url":"https://image.baidu.com/search/detail?ct=503316480&z=undefined&tn=baiduimagedetail&ipn=d&word=%E5%9B%BE%E7%89%87&step_word=&ie=utf-8&in=&cl=2&lm=-1&st=undefined&hd=undefined&latest=undefined&copyright=undefined&cs=2631334549,246605465&os=925726685,274215688&simid=4204922451,643817904&pn=59&rn=1&di=32230&ln=1566&fr=&fmq=1609933260618_R&fm=&ic=undefined&s=undefined&se=&sme=&tab=0&width=undefined&height=undefined&face=undefined&is=0,0&istype=0&ist=&jit=&bdtype=0&spn=0&pi=0&gsm=0&hs=2&objurl=https%3A%2F%2Fgimg2.baidu.com%2Fimage_search%2Fsrc%3Dhttp%253A%252F%252Fa4.att.hudong.com%252F52%252F35%252F01300000248079122537357453023.jpg%26refer%3Dhttp%253A%252F%252Fa4.att.hudong.com%26app%3D2002%26size%3Df9999%2C10000%26q%3Da80%26n%3D0%26g%3D0n%26fmt%3Djpeg%3Fsec%3D1612525262%26t%3D923b32ede80b565aa16a7dcf9153ebed&rpstart=0&rpnum=0&adpicid=0&force=undefined"}},"theme":"default","author":"liuyi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Linux大作业","language":"zh-hans","gitbook":"*","description":"666"},"file":{"path":"3.md","mtime":"2021-01-06T09:34:11.891Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-06T13:45:05.512Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

