
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章 · Linux大作业</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="liuyi">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="7.html" />
    
    
    <link rel="prev" href="5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第六章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;6&#x7AE0;-&#x53D1;&#x8D22;&#x4E86;">&#x7B2C;6&#x7AE0; &#x53D1;&#x8D22;&#x4E86;</h1>
<p>&#x9646;&#x9E23;&#x4ED4;&#x7EC6;&#x627E;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x679C;&#x7136;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x6761;&#x767B;&#x5C71;&#x4E4B;&#x8DEF;&#xFF0C;&#x8FD9;&#x6761;&#x867D;&#x7136;&#x9661;&#x5CED;&#xFF0C;&#x4F46;&#x4EE5;&#x9646;&#x9E23;&#x7684;&#x4FEE;&#x4E3A;&#xFF0C;&#x8DB3;&#x4EE5;&#x767B;&#x4E0A;&#x53BB;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x5927;&#x559C;&#xFF0C;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x8DEF;&#x5411;&#x4E0A;&#x767B;&#x53BB;&#x3002;</p>
<p>  &#x5341;&#x51E0;&#x5206;&#x949F;&#x540E;&#xFF0C;&#x9646;&#x9E23;&#x6765;&#x5230;&#x4E86;&#x5C71;&#x9876;&#x3002;</p>
<p>  &#x6C99;&#x86C7;&#x76D7;&#x4F3C;&#x4E4E;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x6761;&#x5C0F;&#x8DEF;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x653E;&#x5FC3;&#xFF0C;&#x8FD9;&#x4E00;&#x5E26;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x628A;&#x5B88;&#x3002;</p>
<p>  &#x5C71;&#x9876;&#x4E0A;&#xFF0C;&#x9759;&#x6084;&#x6084;&#x7684;&#xFF0C;&#x60F3;&#x5FC5;&#x4EBA;&#x90FD;&#x5230;&#x524D;&#x5C71;&#x53BB;&#x62B5;&#x6321;&#x674E;&#x5BB6;&#x53BB;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6309;&#x7167;&#x674E;&#x5CF0;&#x7684;&#x63CF;&#x7ED8;&#xFF0C;&#x5411;&#x7740;&#x6C99;&#x86C7;&#x76D7;&#x9996;&#x9886;&#x7684;&#x5367;&#x5BA4;&#x800C;&#x53BB;&#xFF0C;&#x636E;&#x674E;&#x5CF0;&#x6240;&#x8A00;&#xFF0C;&#x6C99;&#x86C7;&#x76D7;&#x9996;&#x9886;&#x628A;&#x8FD9;&#x4E9B;&#x5E74;&#x52AB;&#x63A0;&#x6765;&#x7684;&#x8D22;&#x5B9D;&#x90FD;&#x85CF;&#x5728;&#x4E86;&#x4ED6;&#x5367;&#x5BA4;&#x7684;&#x5E8A;&#x5E95;&#x4E0B;&#x3002;</p>
<p>  &#x5982;&#x679C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6C99;&#x86C7;&#x76D7;&#x9996;&#x9886;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x59BE;&#xFF0C;&#x7ECF;&#x5E38;&#x8981;&#x5192;&#x5145;&#x666E;&#x901A;&#x4EBA;&#x5230;&#x98CE;&#x706B;&#x57CE;&#x91C7;&#x8D2D;&#x4E1C;&#x897F;&#xFF0C;&#x88AB;&#x674E;&#x5CF0;&#x52FE;&#x642D;&#x53BB;&#x4E86;&#xFF0C;&#x8FD8;&#x771F;&#x6CA1;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x6C99;&#x86C7;&#x76D7;&#x9996;&#x9886;&#x7684;&#x8D22;&#x5B9D;&#x85CF;&#x5728;&#x54EA;&#x91CC;&#x3002;</p>
<p>  &#x4E0D;&#x4E00;&#x4F1A;&#xFF0C;&#x9646;&#x9E23;&#x4FBF;&#x6765;&#x5230;&#x4E86;&#x6C99;&#x86C7;&#x76D7;&#x9996;&#x9886;&#x7684;&#x5367;&#x5BA4;&#xFF0C;&#x7FFB;&#x5F00;&#x5E8A;&#x5E95;&#x4E0B;&#x7684;&#x5730;&#x677F;&#x540E;&#xFF0C;&#x679C;&#x7136;&#x53D1;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x5927;&#x7BB1;&#x5B50;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x5C0F;&#x7BB1;&#x5B50;&#x3002;</p>
<p>  &#x4E24;&#x4E2A;&#x5927;&#x7BB1;&#x5B50;&#xFF0C;&#x88C5;&#x7684;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x94F6;&#x707F;&#x707F;&#x7684;&#x767D;&#x94F6;&#xFF0C;&#x800C;&#x90A3;&#x4E2A;&#x5C0F;&#x7BB1;&#x5B50;&#xFF0C;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x94F6;&#x7968;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x5927;&#x559C;&#xFF0C;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x6E05;&#x70B9;&#xFF0C;&#x5168;&#x90E8;&#x6536;&#x5230;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x95EA;&#x8EAB;&#xFF0C;&#x6CBF;&#x7740;&#x6765;&#x8DEF;&#x98DE;&#x5954;&#x800C;&#x56DE;&#x3002;</p>
<p>  &#x4E0B;&#x4E86;&#x5C71;&#x5CF0;&#xFF0C;&#x9646;&#x9E23;&#x6CA1;&#x6709;&#x505C;&#x7559;&#xFF0C;&#x5411;&#x7740;&#x98CE;&#x706B;&#x57CE;&#x800C;&#x53BB;&#x3002;</p>
<p>  &#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x674E;&#x5BB6;&#x4E0D;&#x7BA1;&#x8F93;&#x8D62;&#xFF0C;&#x6CE8;&#x5B9A;&#x662F;&#x8DB3;&#x84DD;&#x6253;&#x6C34;&#x4E00;&#x573A;&#x7A7A;&#x4E86;&#x3002;</p>
<p>  &#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x540E;&#xFF0C;&#x9646;&#x9E23;&#x56DE;&#x5230;&#x4E86;&#x9646;&#x5BB6;&#xFF0C;&#x4E00;&#x56DE;&#x6765;&#xFF0C;&#x548C;&#x674E;&#x840D;&#x6253;&#x4E86;&#x58F0;&#x62DB;&#x547C;&#xFF0C;&#x4FBF;&#x56DE;&#x5230;&#x623F;&#x95F4;&#xFF0C;&#x8FDB;&#x5165;&#x5230;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#x4E2D;&#xFF0C;&#x6025;&#x5FD9;&#x7684;&#x6E05;&#x70B9;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x6E05;&#x70B9;&#x540E;&#x7684;&#x6570;&#x91CF;&#x8BA9;&#x9646;&#x9E23;&#x5927;&#x5403;&#x4E00;&#x60CA;&#x3002;</p>
<p>  &#x94F6;&#x7968;&#x8DB3;&#x8DB3;&#x6709;&#x5341;&#x4E07;&#x4E24;&#xFF0C;&#x800C;&#x4E24;&#x5927;&#x7BB1;&#x767D;&#x94F6;&#xFF0C;&#x4E5F;&#x6709;&#x4E09;&#x4E07;&#x4E24;&#x3002;</p>
<p>  &#x52A0;&#x8D77;&#x6765;&#x4E00;&#x5171;&#x6709;&#x5341;&#x4E09;&#x4E07;&#x4E24;&#x3002;</p>
<p>  &#x53EF;&#x89C1;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#xFF0C;&#x6C99;&#x86C7;&#x76D7;&#x6253;&#x5BB6;&#x52AB;&#x820D;&#xFF0C;&#x53EF;&#x771F;&#x662F;&#x52AB;&#x63A0;&#x4E86;&#x4E0D;&#x5C11;&#x8D22;&#x5B9D;&#x554A;&#xFF0C;&#x53EF;&#x73B0;&#x5728;&#x5168;&#x90E8;&#x4FBF;&#x5B9C;&#x4E86;&#x9646;&#x9E23;&#x3002;</p>
<p>  &#x201C;&#x6709;&#x8FD9;&#x4E9B;&#x94F6;&#x5B50;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x5927;&#x91CF;&#x7684;&#x9F99;&#x864E;&#x4E39;&#x4FEE;&#x70BC;&#x4E86;&#xFF0C;&#x9646;&#x7476;&#xFF0C;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#x540E;&#x7684;&#x9646;&#x5BB6;&#x65CF;&#x4F1A;&#x4E0A;&#xFF0C;&#x4F60;&#x4F11;&#x60F3;&#x6267;&#x638C;&#x9646;&#x5BB6;&#xFF0C;&#x8FD8;&#x6709;&#xFF0C;&#x6211;&#x4F1A;&#x593A;&#x56DE;&#x5C5E;&#x4E8E;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x53CC;&#x62F3;&#x7D27;&#x7D27;&#x7684;&#x63E1;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x773C;&#x795E;&#x4E2D;&#x5145;&#x65A5;&#x7740;&#x4E0D;&#x5C48;&#x4E0E;&#x575A;&#x5B9A;&#x3002;</p>
<p>  &#x968F;&#x540E;&#xFF0C;&#x9646;&#x9E23;&#x51FA;&#x4E86;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#xFF0C;&#x5F80;&#x98CE;&#x706B;&#x57CE;&#x7684;&#x574A;&#x5E02;&#x800C;&#x53BB;&#x3002;</p>
<p>  &#x98CE;&#x706B;&#x57CE;&#x7684;&#x574A;&#x5E02;&#xFF0C;&#x662F;&#x98CE;&#x706B;&#x57CE;&#x6700;&#x7E41;&#x534E;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90A3;&#x91CC;&#x6709;&#x7740;&#x5404;&#x79CD;&#x5E97;&#x94FA;&#x3002;</p>
<p>  &#x5982;&#x4E39;&#x836F;&#x666E;&#xFF0C;&#x5175;&#x5668;&#x94FA;&#xFF0C;&#x6750;&#x6599;&#x94FA;&#x7B49;&#x7B49;&#xFF0C;&#x5404;&#x5730;&#x7684;&#x5546;&#x961F;&#x5F80;&#x6765;&#xFF0C;&#x4EBA;&#x53E3;&#x7EDC;&#x7ECE;&#x4E0D;&#x7EDD;&#x3002;</p>
<p>  &#x5728;&#x9014;&#x4E2D;&#xFF0C;&#x9646;&#x9E23;&#x4E70;&#x4E86;&#x4E00;&#x5957;&#x9ED1;&#x888D;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x9ED1;&#x8272;&#x7684;&#x6597;&#x7B20;&#xFF0C;&#x5C06;&#x6574;&#x4E2A;&#x4EBA;&#x90FD;&#x88F9;&#x5728;&#x6597;&#x7B20;&#x548C;&#x9ED1;&#x888D;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>  &#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x4ED6;&#x8981;&#x8D2D;&#x4E70;&#x5927;&#x91CF;&#x7684;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x7EDD;&#x4E0D;&#x80FD;&#x88AB;&#x522B;&#x4EBA;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x8EAB;&#x4EFD;&#x3002;</p>
<p>  &#x7075;&#x836F;&#x5802;&#xFF0C;&#x662F;&#x98CE;&#x706B;&#x57CE;&#x6700;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x4E70;&#x5356;&#x4E39;&#x836F;&#x7684;&#x5E97;&#x94FA;&#xFF0C;&#x5360;&#x5730;&#x5341;&#x4EA9;&#xFF0C;&#x9AD8;&#x8FBE;&#x56DB;&#x5C42;&#xFF0C;&#x5BBD;&#x9614;&#x65E0;&#x6BD4;&#x3002;</p>
<p>  &#x636E;&#x8BF4;&#xFF0C;&#x7075;&#x836F;&#x5802;&#x6765;&#x5934;&#x5F88;&#x5927;&#xFF0C;&#x80CC;&#x540E;&#x9760;&#x7684;&#x662F;&#x7384;&#x5143;&#x5251;&#x6D3E;&#x3002;</p>
<p>  &#x8D70;&#x8FDB;&#x7075;&#x836F;&#x5802;&#xFF0C;&#x7ACB;&#x523B;&#x6709;&#x4E00;&#x4E2A;&#x5C11;&#x5973;&#x8FCE;&#x4E86;&#x4E0A;&#x6765;&#xFF0C;&#x5A07;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x8FD9;&#x4F4D;&#x5BA2;&#x5B98;&#xFF0C;&#x8BF7;&#x95EE;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#xFF1F;&#x201D;</p>
<p>  &#x5979;&#x5BF9;&#x4E8E;&#x53E4;&#x602A;&#x7684;&#x5BA2;&#x4EBA;&#x89C1;&#x591A;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x9646;&#x9E23;&#x8EAB;&#x7A7F;&#x9ED1;&#x888D;&#x6597;&#x7B20;&#xFF0C;&#x6CA1;&#x6709;&#x4E1D;&#x6BEB;&#x7684;&#x5947;&#x602A;&#x7684;&#x3002;</p>
<p>  &#x800C;&#x4E14;&#x5F80;&#x5F80;&#x8FD9;&#x6837;&#x53E4;&#x602A;&#x7684;&#x5BA2;&#x4EBA;&#xFF0C;&#x751F;&#x610F;&#x53EF;&#x80FD;&#x4F1A;&#x8D8A;&#x5927;&#x3002;</p>
<p>  &#x201C;&#x6211;&#x8981;&#x8D2D;&#x4E70;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4F60;&#x4EEC;&#x8FD9;&#x91CC;&#x4EC0;&#x4E48;&#x4EF7;&#x683C;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x6545;&#x610F;&#x628A;&#x58F0;&#x97F3;&#x538B;&#x4F4E;&#xFF0C;&#x663E;&#x5F97;&#x6D51;&#x539A;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x542C;&#x4E0A;&#x53BB;&#x50CF;&#x662F;&#x4E09;&#x5341;&#x591A;&#x5C81;&#x7684;&#x4E2D;&#x5E74;&#x4EBA;&#x3002;</p>
<p>  &#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4E00;&#x767E;&#x4E24;&#x94F6;&#x5B50;&#x4E00;&#x9897;&#xFF0C;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4E09;&#x767E;&#x4E24;&#x94F6;&#x5B50;&#x4E00;&#x9897;&#xFF0C;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4E00;&#x5343;&#x4E24;&#x94F6;&#x5B50;&#x4E00;&#x9897;&#xFF0C;&#x8BF7;&#x95EE;&#x4F60;&#x8981;&#x8D2D;&#x4E70;&#x4EC0;&#x4E48;&#x54C1;&#x7EA7;&#x7684;&#xFF1F;&#x8D2D;&#x4E70;&#x591A;&#x5C11;&#xFF1F;&#x201D;</p>
<p>  &#x5973;&#x5E97;&#x5458;&#x95EE;&#x9053;&#x3002;</p>
<p>  &#x4E39;&#x836F;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x5206;&#x4E5D;&#x7EA7;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x5206;&#x4E3A;&#x4E0A;&#x4E2D;&#x4E0B;&#x4E09;&#x54C1;&#x3002;</p>
<p>  &#x201C;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x4E09;&#x5341;&#x9897;&#xFF0C;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x4E09;&#x5341;&#x9897;&#x3002;&#x201D;&#x9646;&#x9E23;&#x5F00;&#x53E3;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x8FD9;...&#x8FD9;&#x4E48;&#x591A;&#xFF1F;&#x201D;&#x5973;&#x5E97;&#x5458;&#x5927;&#x5403;&#x4E00;&#x60CA;&#xFF0C;&#x63A5;&#x7740;&#x4FBF;&#x662F;&#x72C2;&#x559C;&#xFF0C;&#x6001;&#x5EA6;&#x66F4;&#x52A0;&#x606D;&#x656C;&#x8D77;&#x6765;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x60A8;&#x8981;&#x4E70;&#x7684;&#x4EF7;&#x683C;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E00;&#x4E07;&#x4E24;&#x767D;&#x94F6;&#x4E86;&#xFF0C;&#x6211;&#x53EF;&#x505A;&#x4E0D;&#x4E86;&#x4E3B;&#xFF0C;&#x5FC5;&#x987B;&#x6211;&#x4EEC;&#x5802;&#x4E3B;&#x4EB2;&#x81EA;&#x63A5;&#x624B;&#xFF0C;&#x5BA2;&#x5B98;&#x60A8;&#x7A0D;&#x7B49;&#xFF0C;&#x6211;&#x53BB;&#x7980;&#x62A5;&#x6211;&#x4EEC;&#x5802;&#x4E3B;&#x3002;&#x201D;</p>
<p>  &#x8BF4;&#x5B8C;&#xFF0C;&#x5973;&#x5E97;&#x5458;&#x5C31;&#x5C0F;&#x8DD1;&#x7684;&#x8FDB;&#x5165;&#x4E86;&#x540E;&#x5802;&#x3002;</p>
<p>  &#x7247;&#x523B;&#x4E4B;&#x540E;&#xFF0C;&#x5973;&#x5E97;&#x5458;&#x51FA;&#x6765;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x6211;&#x4EEC;&#x5802;&#x4E3B;&#x8BF7;&#x4F60;&#x5230;&#x540E;&#x5802;&#x4E00;&#x53D9;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x70B9;&#x70B9;&#x5934;&#xFF0C;&#x8DDF;&#x7740;&#x5973;&#x5E97;&#x5458;&#x6765;&#x5230;&#x540E;&#x5802;&#x3002;</p>
<p>  &#x63A5;&#x7740;&#x5973;&#x5E97;&#x5458;&#x5E2E;&#x9646;&#x9E23;&#x5012;&#x4E0A;&#x8336;&#xFF0C;&#x4FBF;&#x9000;&#x4E86;&#x51FA;&#x53BB;&#x3002;</p>
<p>  &#x540E;&#x5802;&#x5E03;&#x7F6E;&#x7684;&#x5F88;&#x5178;&#x96C5;&#xFF0C;&#x9646;&#x9E23;&#x968F;&#x610F;&#x626B;&#x4E86;&#x51E0;&#x773C;&#xFF0C;&#x7AEF;&#x8D77;&#x8336;&#x559D;&#x4E86;&#x51E0;&#x53E3;&#x3002;</p>
<p>  &#x8FD9;&#x65F6;&#xFF0C;&#x4E00;&#x9635;&#x9999;&#x98CE;&#x4F20;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8C;&#x5341;&#x5C81;&#x5DE6;&#x53F3;&#x7684;&#x5E74;&#x8F7B;&#x5973;&#x5B50;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#x3002;</p>
<p>  &#x5E74;&#x8F7B;&#x5973;&#x5B50;&#x7A7F;&#x7740;&#x7EA2;&#x8272;&#x7D27;&#x8EAB;&#x957F;&#x88D9;&#xFF0C;&#x80F8;&#x524D;&#x90A3;&#x5DE8;&#x5927;&#x7684;&#x8089;&#x7403;&#x5C06;&#x7EA2;&#x88D9;&#x9AD8;&#x9AD8;&#x6491;&#x8D77;&#xFF0C;&#x4EFF;&#x4F5B;&#x8981;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x7684;&#x6491;&#x7834;&#x8863;&#x670D;&#x8DF3;&#x51FA;&#x6765;&#x4E00;&#x822C;&#x3002;</p>
<p>  &#x8170;&#x8EAB;&#x76C8;&#x76C8;&#x4E00;&#x63E1;&#xFF0C;&#x5982;&#x6C34;&#x86C7;&#x4E00;&#x822C;&#x626D;&#x52A8;&#x7740;&#xFF0C;&#x800C;&#x6781;&#x4E3A;&#x633A;&#x7FD8;&#x7684;&#x4E30;&#x81C0;&#xFF0C;&#x5C06;&#x957F;&#x88D9;&#x51F8;&#x663E;&#x51FA;&#x4E00;&#x6761;&#x6781;&#x4E3A;&#x8BF1;&#x4EBA;&#x7684;&#x66F2;&#x7EBF;&#x3002;</p>
<p>  &#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x53CC;&#x5982;&#x79CB;&#x6C34;&#x4E00;&#x822C;&#x7684;&#x7F8E;&#x7738;&#xFF0C;&#x7EA2;&#x6DA6;&#x7684;&#x5634;&#x5507;&#xFF0C;&#x5439;&#x5F39;&#x53EF;&#x7834;&#x7684;&#x808C;&#x80A4;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x80A1;&#x5F3A;&#x70C8;&#x89C6;&#x51B2;&#x51FB;&#x529B;&#xFF0C;&#x548C;&#x6781;&#x81F4;&#x7684;&#x8BF1;&#x60D1;&#x529B;&#x3002;</p>
<p>  &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7978;&#x56FD;&#x6B83;&#x6C11;&#x7684;&#x5996;&#x5A06;&#x5973;&#x5B50;&#xFF0C;&#x9646;&#x9E23;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#xFF0C;&#x5FC3;&#x8DF3;&#x5C31;&#x4E0D;&#x7981;&#x52A0;&#x901F;&#x7684;&#x8DF3;&#x52A8;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x8FD9;&#x4F4D;&#x5BA2;&#x5B98;&#xFF0C;&#x5C0F;&#x5973;&#x5B50;&#x7A46;&#x5170;&#xFF0C;&#x662F;&#x8FD9;&#x7075;&#x836F;&#x5802;&#x7684;&#x5802;&#x4E3B;&#xFF0C;&#x542C;&#x8BF4;&#x4F60;&#x8981;&#x4E70;&#x4E09;&#x5341;&#x9897;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#x548C;&#x4E09;&#x5341;&#x9897;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF1F;&#x201D;</p>
<p>  &#x58F0;&#x97F3;&#x751C;&#x817B;&#xFF0C;&#x597D;&#x50CF;&#x80FD;&#x8BA9;&#x4EBA;&#x9AA8;&#x5934;&#x90FD;&#x9165;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x6DF1;&#x5438;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x51B7;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x538B;&#x7740;&#x58F0;&#x97F3;&#x9053;&#xFF1A;&#x201C;&#x4E0D;&#x9519;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x5BF9;&#x4E8E;&#x4E00;&#x6B21;&#x6027;&#x6D88;&#x8D39;&#x4E00;&#x4E07;&#x4E24;&#x4EE5;&#x4E0A;&#x7684;&#x5BA2;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x6253;&#x4E5D;&#x6298;&#x7684;&#xFF0C;&#x603B;&#x5171;&#x7684;&#x4E39;&#x836F;&#x52A0;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x4E07;&#x4E24;&#x5343;&#x4E24;&#x767D;&#x94F6;&#xFF0C;&#x6253;&#x4E5D;&#x6298;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E07;&#x96F6;&#x516B;&#x767E;&#x91CF;&#x3002;&#x201D;</p>
<p>  &#x7A46;&#x5170;&#x5A07;&#x58F0;&#x9053;&#xFF0C;&#x4E00;&#x53CC;&#x7F8E;&#x7738;&#x5728;&#x9646;&#x9E23;&#x8EAB;&#x4E0A;&#x626B;&#x6765;&#x626B;&#x53BB;&#x3002;</p>
<p>  &#x201C;&#x90A3;&#x591A;&#x8C22;&#x7A46;&#x5802;&#x4E3B;&#x4E86;&#x3002;&#x201D;&#x9646;&#x9E23;&#x4E00;&#x62B1;&#x62F3;&#x9053;&#x3002;</p>
<p>  &#x968F;&#x540E;&#xFF0C;&#x7A46;&#x5170;&#x62CD;&#x4E86;&#x62CD;&#x624B;&#xFF0C;&#x4E00;&#x4E2A;&#x4F8D;&#x5973;&#x6A21;&#x6837;&#x7684;&#x5C11;&#x5973;&#x7AEF;&#x7740;&#x4E24;&#x4E2A;&#x76D2;&#x5B50;&#x8FDB;&#x6765;&#xFF0C;&#x91CC;&#x9762;&#x5206;&#x522B;&#x88C5;&#x7740;&#x4E09;&#x5341;&#x9897;&#x9F99;&#x864E;&#x4E39;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E5F;&#x62FF;&#x51FA;&#x4E00;&#x4E07;&#x96F6;&#x516B;&#x767E;&#x4E24;&#x94F6;&#x7968;&#xFF0C;&#x4EA4;&#x7ED9;&#x4E86;&#x7A46;&#x5170;&#x3002;</p>
<p>  &#x201C;&#x7A46;&#x5802;&#x4E3B;&#xFF0C;&#x5728;&#x4E0B;&#x5C31;&#x544A;&#x8F9E;&#x4E86;&#x3002;&#x201D;&#x63A5;&#x8FC7;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x9646;&#x9E23;&#x5411;&#x7A46;&#x5170;&#x544A;&#x8F9E;&#x3002;</p>
<p>  &#x201C;&#x5BA2;&#x5B98;&#x5982;&#x679C;&#x8FD8;&#x9700;&#x8981;&#x4E70;&#x4E39;&#x836F;&#xFF0C;&#x53EF;&#x6765;&#x7075;&#x836F;&#x5802;&#xFF0C;&#x4E00;&#x5F8B;&#x6253;&#x4E5D;&#x6298;&#x54E6;&#x3002;&#x201D;&#x7A46;&#x5170;&#x9732;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x59A9;&#x5A9A;&#x7684;&#x7B11;&#x5BB9;&#xFF0C;&#x626D;&#x52A8;&#x7740;&#x6C34;&#x86C7;&#x4E00;&#x822C;&#x7684;&#x8170;&#x80A2;&#xFF0C;&#x9760;&#x8FD1;&#x9646;&#x9E23;&#xFF0C;&#x987F;&#x65F6;&#x4E00;&#x80A1;&#x8FF7;&#x4EBA;&#x7684;&#x5E7D;&#x9999;&#x94BB;&#x8FDB;&#x9646;&#x9E23;&#x7684;&#x9F3B;&#x5B50;&#x3002;</p>
<p>  &#x8FD9;&#x662F;&#x7A46;&#x5170;&#x7684;&#x4F53;&#x9999;&#xFF0C;&#x5341;&#x5206;&#x8BF1;&#x4EBA;&#xFF0C;&#x8BA9;&#x4EBA;&#x5145;&#x6EE1;&#x5E7B;&#x60F3;&#x3002;</p>
<p>  &#x201C;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x8BF1;&#x4EBA;&#x7684;&#x5996;&#x5973;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x5FC3;&#x91CC;&#x4E00;&#x8DF3;&#xFF0C;&#x6025;&#x5FD9;&#x62B1;&#x62F3;&#x544A;&#x8F9E;&#xFF0C;&#x9003;&#x4E5F;&#x4F3C;&#x7684;&#x79BB;&#x5F00;&#x4E86;&#x8FD9;&#x91CC;&#x3002;</p>
<p>  &#x671B;&#x7740;&#x9646;&#x9E23;&#x79BB;&#x53BB;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x7A46;&#x5170;&#x7EA2;&#x6DA6;&#x7684;&#x5634;&#x5507;&#x5FAE;&#x5FAE;&#x6485;&#x8D77;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x6709;&#x610F;&#x601D;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x5C0F;&#x59D0;&#xFF0C;&#x6211;&#x770B;&#x8FD9;&#x4E2A;&#x4EBA;&#x867D;&#x7136;&#x5E26;&#x7740;&#x6597;&#x7B20;&#xFF0C;&#x4F46;&#x4E5F;&#x5F88;&#x666E;&#x901A;&#x554A;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x201D;&#x4E00;&#x65C1;&#x4F8D;&#x5973;&#x6709;&#x4E9B;&#x597D;&#x5947;&#x7684;&#x95EE;&#x3002;</p>
<p>  &#x7A46;&#x5170;&#x4E00;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x5C0F;&#x53F6;&#xFF0C;&#x4F60;&#x6CA1;&#x770B;&#x51FA;&#x6765;&#x5427;&#xFF1F;&#x521A;&#x624D;&#x4ED6;&#x662F;&#x6545;&#x610F;&#x538B;&#x4F4E;&#x4E86;&#x58F0;&#x97F3;&#xFF0C;&#x88C5;&#x6210;&#x4E2D;&#x5E74;&#x4EBA;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x4E2A;&#x5C11;&#x5E74;&#xFF0C;&#x5728;&#x98CE;&#x706B;&#x57CE;&#xFF0C;&#x80FD;&#x8F7B;&#x6613;&#x62FF;&#x51FA;&#x4E07;&#x4E24;&#x767D;&#x94F6;&#x7684;&#x5C11;&#x5E74;&#x53EF;&#x4E0D;&#x591A;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x800C;&#x4E14;&#x6211;&#x7684;&#x8840;&#x8109;&#xFF0C;&#x8D4B;&#x4E88;&#x6211;&#x8D85;&#x5F3A;&#x7684;&#x611F;&#x77E5;&#x529B;&#xFF0C;&#x521A;&#x624D;&#x6211;&#x611F;&#x89C9;&#x6B64;&#x4EBA;&#x7684;&#x8840;&#x8109;&#x5F88;&#x53E4;&#x602A;&#xFF0C;&#x4F3C;&#x4E4E;&#x8574;&#x542B;&#x4E86;&#x5F3A;&#x5927;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5374;&#x53C8;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x5728;&#x751F;&#x957F;&#x4E00;&#x822C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x6709;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x5C0F;&#x59D0;&#xFF0C;&#x542C;&#x4F60;&#x8FD9;&#x4E48;&#x4E00;&#x8BF4;&#xFF0C;&#x7684;&#x786E;&#x5F88;&#x6709;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x201D;&#x4F8D;&#x5973;&#x4E5F;&#x7728;&#x5DF4;&#x773C;&#x775B;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x5C0F;&#x53F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E0B;&#x6B21;&#x518D;&#x6765;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x901A;&#x77E5;&#x6211;&#x54E6;&#xFF01;&#x201D;&#x7A46;&#x5170;&#x773C;&#x4E2D;&#x95EA;&#x70C1;&#x7740;&#x597D;&#x5947;&#x7684;&#x5149;&#x8292;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; ly@cqkjuniversity.com 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-01-06 19:22:35
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="7.html" class="navigation navigation-next " aria-label="Next page: 第七章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章","level":"1.8","depth":1,"next":{"title":"第七章","level":"1.9","depth":1,"path":"7.md","ref":"7.md","articles":[]},"previous":{"title":"第五章","level":"1.7","depth":1,"path":"5.md","ref":"5.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","chapter-fold","code","splitter","-lunr","-search","search-pro","insert-logo","custom-favicon","pageview-count","tbfed-pagefooter","popup","-sharing","sharing-plus","donate","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy ly@cqkjuniversity.com 2021","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://i.loli.net/2021/01/06/AXCKm6Mp2oxFngb.png","wechatText":"微信"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"./icon/book.ico","back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 30px; min-height: 30px","url":"https://image.baidu.com/search/detail?ct=503316480&z=undefined&tn=baiduimagedetail&ipn=d&word=%E5%9B%BE%E7%89%87&step_word=&ie=utf-8&in=&cl=2&lm=-1&st=undefined&hd=undefined&latest=undefined&copyright=undefined&cs=2631334549,246605465&os=925726685,274215688&simid=4204922451,643817904&pn=59&rn=1&di=32230&ln=1566&fr=&fmq=1609933260618_R&fm=&ic=undefined&s=undefined&se=&sme=&tab=0&width=undefined&height=undefined&face=undefined&is=0,0&istype=0&ist=&jit=&bdtype=0&spn=0&pi=0&gsm=0&hs=2&objurl=https%3A%2F%2Fgimg2.baidu.com%2Fimage_search%2Fsrc%3Dhttp%253A%252F%252Fa4.att.hudong.com%252F52%252F35%252F01300000248079122537357453023.jpg%26refer%3Dhttp%253A%252F%252Fa4.att.hudong.com%26app%3D2002%26size%3Df9999%2C10000%26q%3Da80%26n%3D0%26g%3D0n%26fmt%3Djpeg%3Fsec%3D1612525262%26t%3D923b32ede80b565aa16a7dcf9153ebed&rpstart=0&rpnum=0&adpicid=0&force=undefined"}},"theme":"default","author":"liuyi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Linux大作业","language":"zh-hans","gitbook":"*","description":"666"},"file":{"path":"6.md","mtime":"2021-01-06T11:22:35.253Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-06T13:45:05.512Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

