
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第八章 · Linux大作业</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="liuyi">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="9.html" />
    
    
    <link rel="prev" href="7.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第八章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;8&#x7AE0;-&#x8FD9;&#x592A;&#x4F4E;&#x7EA7;&#x4E86;">&#x7B2C;8&#x7AE0; &#x8FD9;&#x592A;&#x4F4E;&#x7EA7;&#x4E86;</h1>
<p>&#x795E;&#x5175;&#x9601;&#xFF0C;&#x98CE;&#x706B;&#x57CE;&#x574A;&#x5E02;&#x8D2D;&#x4E70;&#x5175;&#x5668;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x91CC;&#x9762;&#x4E0D;&#x4EC5;&#x6709;&#x666E;&#x901A;&#x4EBA;&#x7528;&#x7684;&#x51E1;&#x5175;&#xFF0C;&#x8FD8;&#x6709;&#x6B66;&#x8005;&#x7528;&#x7684;&#x7075;&#x5175;&#x3002;</p>
<p>  &#x7075;&#x5175;&#xFF0C;&#x4EE5;&#x73CD;&#x60DC;&#x6750;&#x6599;&#x6253;&#x9020;&#xFF0C;&#x950B;&#x5229;&#x65E0;&#x6BD4;&#xFF0C;&#x524A;&#x94C1;&#x5982;&#x6CE5;&#xFF0C;&#x751A;&#x81F3;&#x5BF9;&#x6B66;&#x8005;&#x7684;&#x6218;&#x529B;&#x90FD;&#x6709;&#x6240;&#x52A0;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7075;&#x5175;&#x624D;&#x662F;&#x6B66;&#x8005;&#x6700;&#x597D;&#x7684;&#x6B66;&#x5668;&#x3002;</p>
<p>  &#x50CF;&#x4E4B;&#x524D;&#xFF0C;&#x9646;&#x9E23;&#x7236;&#x4EB2;&#x7559;&#x4E0B;&#xFF0C;&#x540E;&#x88AB;&#x9646;&#x5DDD;&#x593A;&#x53D6;&#x7684;&#x90A3;&#x628A;&#x957F;&#x5251;&#xFF0C;&#x5C31;&#x662F;&#x7075;&#x5175;&#x3002;</p>
<p>  &#x7075;&#x5175;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E5D;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x53C8;&#x5206;&#x4E3A;&#x4E0B;&#x54C1;&#xFF0C;&#x4E2D;&#x54C1;&#xFF0C;&#x4E0A;&#x54C1;&#x3002;</p>
<p>  &#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x9646;&#x9E23;&#x5C31;&#x662F;&#x60F3;&#x5148;&#x8D2D;&#x4E70;&#x4E00;&#x628A;&#x7075;&#x5175;&#xFF0C;&#x7528;&#x6765;&#x4FEE;&#x70BC;&#x5251;&#x6CD5;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E0E;&#x79CB;&#x6708;&#xFF0C;&#x4E00;&#x8D77;&#x8D70;&#x8FDB;&#x4E86;&#x795E;&#x5175;&#x9601;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>  &#x795E;&#x5175;&#x9601;&#x4E2D;&#xFF0C;&#x7AD9;&#x7ACB;&#x7740;&#x4E24;&#x6392;&#x5E74;&#x8F7B;&#x8C8C;&#x7F8E;&#x7684;&#x5973;&#x5B50;&#xFF0C;&#x662F;&#x795E;&#x5175;&#x9601;&#x91CC;&#x9762;&#x63A5;&#x5F85;&#x5BA2;&#x4EBA;&#x7684;&#x5973;&#x5E97;&#x5458;&#x3002;</p>
<p>  &#x4F46;&#x5F53;&#x9646;&#x9E23;&#x4E0E;&#x79CB;&#x6708;&#x8D70;&#x8FDB;&#x5E97;&#x94FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x5973;&#x5E97;&#x5458;&#x90FD;&#x76B1;&#x4E86;&#x76B1;&#x7709;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5973;&#x5E97;&#x5458;&#x4E0A;&#x524D;&#x63A5;&#x5F85;&#x7684;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E0E;&#x79CB;&#x6708;&#x4E24;&#x4EBA;&#xFF0C;&#x7A7F;&#x7684;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x9646;&#x9E23;&#x7A7F;&#x7684;&#x662F;&#x7B80;&#x5355;&#x7684;&#x7C97;&#x5E03;&#x8863;&#x88F3;&#xFF0C;&#x800C;&#x79CB;&#x6708;&#xFF0C;&#x66F4;&#x662F;&#x7A7F;&#x7740;&#x4F8D;&#x5973;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E97;&#x5458;&#x90FD;&#x662F;&#x8001;&#x6C5F;&#x6E56;&#x4E86;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x4E24;&#x4EBA;&#x662F;&#x6CA1;&#x6709;&#x94B1;&#x7684;&#x90A3;&#x79CD;&#x3002;</p>
<p>  &#x81EA;&#x7136;&#x6CA1;&#x6709;&#x4EBA;&#x60F3;&#x63A5;&#x5F85;&#x4E24;&#x4EBA;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x5FAE;&#x5FAE;&#x8E59;&#x7709;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x7406;&#x4F1A;&#xFF0C;&#x81EA;&#x4E2A;&#x770B;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x795E;&#x5175;&#x9601;&#x4E2D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x662F;&#x51E1;&#x5175;&#xFF0C;&#x4E00;&#x7EA7;&#x7075;&#x5175;&#x90FD;&#x975E;&#x5E38;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x90E8;&#x5206;&#x7684;&#x8FD8;&#x53EA;&#x662F;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#x90FD;&#x5F88;&#x5C11;&#xFF0C;&#x9646;&#x9E23;&#x8F6C;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x53EA;&#x770B;&#x5230;&#x4E09;&#x628A;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E00;&#x628A;&#x90FD;&#x6CA1;&#x6709;&#x770B;&#x4E2D;&#xFF0C;&#x8981;&#x4E70;&#xFF0C;&#x4ED6;&#x6253;&#x7B97;&#x4E70;&#x4E00;&#x628A;&#x597D;&#x4E00;&#x4E9B;&#x7684;&#x3002;</p>
<p>  &#x201C;&#x8FD9;&#x4F4D;&#x516C;&#x5B50;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5E2E;&#x5FD9;&#x7684;&#x5417;&#xFF1F;&#x6211;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x63A8;&#x4ECB;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x8FD9;&#x65F6;&#xFF0C;&#x4E00;&#x9053;&#x602F;&#x751F;&#x751F;&#x7684;&#x58F0;&#x97F3;&#x54CD;&#x8D77;&#x3002;</p>
<p>  &#x5510;&#x67AB;&#x8F6C;&#x5934;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x7684;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x5706;&#x8138;&#xFF0C;&#x8138;&#x8272;&#x5FAE;&#x7EA2;&#xFF0C;&#x770B;&#x7740;&#x9646;&#x9E23;&#xFF0C;&#x663E;&#x5F97;&#x6709;&#x4E9B;&#x5C40;&#x4FC3;&#x3002;</p>
<p>  &#x5979;&#x662F;&#x8FD9;&#x5BB6;&#x5175;&#x5668;&#x94FA;&#x65B0;&#x6765;&#x7684;&#x5E97;&#x5458;&#xFF0C;&#x4E3A;&#x4EBA;&#x6BD4;&#x8F83;&#x5BB3;&#x7F9E;&#xFF0C;&#x4E1A;&#x7EE9;&#x4E5F;&#x5DEE;&#xFF0C;&#x521A;&#x624D;&#x770B;&#x5230;&#x90FD;&#x6CA1;&#x6709;&#x4EBA;&#x63A5;&#x5F85;&#x9646;&#x9E23;&#xFF0C;&#x5979;&#x4FBF;&#x5927;&#x7740;&#x80C6;&#x5B50;&#x4E0A;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x8FD9;&#x4E2B;&#x5934;&#x8FD9;&#x4E2A;&#x6708;&#x6CA1;&#x4E1A;&#x7EE9;&#xFF0C;&#x771F;&#x662F;&#x6025;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x5979;&#x4E5F;&#x63A5;&#x5F85;&#xFF1F;&#x4EE5;&#x6211;&#x4ECE;&#x4E8B;&#x8FD9;&#x4E00;&#x884C;&#x591A;&#x5E74;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x5B50;&#x80FD;&#x4E70;&#x4E00;&#x628A;&#x5341;&#x4E24;&#x94F6;&#x5B50;&#x7684;&#x94C1;&#x5251;&#x7B97;&#x662F;&#x4E0D;&#x9519;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x53EF;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x63A5;&#x5F85;&#x8FD9;&#x6837;&#x7684;&#x4E61;&#x5DF4;&#x4F6C;&#xFF0C;&#x6211;&#x8FD8;&#x4E0D;&#x5982;&#x7AD9;&#x5728;&#x8FD9;&#x91CC;&#x4F11;&#x606F;&#x5462;&#xFF1F;&#x201D;</p>
<p>  &#x4E0D;&#x8FDC;&#x5904;&#xFF0C;&#x51E0;&#x4E2A;&#x5973;&#x5E97;&#x5458;&#x770B;&#x7740;&#x9646;&#x9E23;&#x8FD9;&#x8FB9;&#xFF0C;&#x7A83;&#x7A83;&#x79C1;&#x8BED;&#x9053;&#x3002;</p>
<p>  &#x867D;&#x7136;&#x58F0;&#x97F3;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x4E00;&#x5B57;&#x4E0D;&#x843D;&#x7684;&#x4F20;&#x8FDB;&#x4E86;&#x9646;&#x9E23;&#xFF0C;&#x79CB;&#x6708;&#x7B49;&#x4EBA;&#x7684;&#x8033;&#x6735;&#x91CC;&#x3002;</p>
<p>  &#x201C;&#x5C11;&#x7237;..&#x201D;&#x79CB;&#x6708;&#x62C9;&#x4E86;&#x62C9;&#x9646;&#x9E23;&#x7684;&#x8863;&#x8896;&#x3002;</p>
<p>  &#x201C;&#x6CA1;&#x4E8B;&#xFF01;&#x201D;&#x9646;&#x9E23;&#x5BF9;&#x79CB;&#x6708;&#x4E00;&#x7B11;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x800C;&#x5DF2;&#xFF0C;&#x4ED6;&#x4E5F;&#x61D2;&#x5F97;&#x4E00;&#x822C;&#x89C1;&#x8BC6;&#x3002;</p>
<p>  &#x521A;&#x8981;&#x95EE;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x6709;&#x6CA1;&#x6709;&#x66F4;&#x9AD8;&#x7EA7;&#x4E00;&#x4E9B;&#x7684;&#x7075;&#x5175;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5374;&#x88AB;&#x4E00;&#x58F0;&#x4E0D;&#x548C;&#x8C10;&#x7684;&#x58F0;&#x97F3;&#x6253;&#x65AD;&#x4E86;&#x3002;</p>
<p>  &#x201C;&#x5466;&#x5466;&#x5466;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x9646;&#x9E23;&#x9646;&#x5927;&#x5C11;&#x7237;&#x5417;&#xFF1F;&#x4EC0;&#x4E48;&#x98CE;&#x628A;&#x4F60;&#x5439;&#x5230;&#x8FD9;&#x91CC;&#x6765;&#x4E86;&#xFF1F;&#x201D;&#x968F;&#x7740;&#x58F0;&#x97F3;&#x7684;&#x843D;&#x4E0B;&#xFF0C;&#x4E00;&#x7537;&#x4E00;&#x5973;&#x4E24;&#x4E2A;&#x5E74;&#x8F7B;&#x4EBA;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#x3002;</p>
<p>  &#x7537;&#x7684;&#x4E00;&#x8138;&#x9EBB;&#x5B50;&#xFF0C;&#x8EAB;&#x6750;&#x4E0D;&#x9AD8;&#xFF0C;&#x504F;&#x504F;&#x7A7F;&#x7740;&#x4E00;&#x4EF6;&#x534E;&#x4E3D;&#x7684;&#x94F6;&#x888D;&#x3002;</p>
<p>  &#x5973;&#x7684;&#x5012;&#x662F;&#x6709;&#x51E0;&#x4EFD;&#x59FF;&#x8272;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x9F3B;&#x5B54;&#x671D;&#x5929;&#xFF0C;&#x4E00;&#x526F;&#x9AD8;&#x50B2;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x5175;&#xFF0C;&#x9646;&#x6885;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x795E;&#x60C5;&#x4E00;&#x52A8;&#x3002;</p>
<p>  &#x9646;&#x5BB6;&#xFF0C;&#x5206;&#x4E3A;&#x4E00;&#x4E3B;&#x4E03;&#x652F;&#xFF0C;&#x5171;&#x516B;&#x8109;&#x3002;</p>
<p>  &#x8FD9;&#x4E24;&#x4EBA;&#xFF0C;&#x9646;&#x9E23;&#x90FD;&#x8BA4;&#x8BC6;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x9646;&#x5BB6;&#x7B2C;&#x4E94;&#x652F;&#x8109;&#x8109;&#x4E3B;&#x7684;&#x513F;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x5219;&#x662F;&#x7B2C;&#x516D;&#x652F;&#x8109;&#x8109;&#x4E3B;&#x7684;&#x5973;&#x513F;&#x3002;</p>
<p>  &#x521A;&#x624D;&#x8BF4;&#x8BDD;&#x7684;&#x5C31;&#x662F;&#x9646;&#x5175;&#x3002;</p>
<p>  &#x9646;&#x5175;&#x6253;&#x91CF;&#x4E86;&#x4E00;&#x4E0B;&#x9646;&#x9E23;&#xFF0C;&#x6709;&#x4E9B;&#x9119;&#x5937;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x600E;&#x4E48;&#xFF1F;&#x9646;&#x9E23;&#xFF0C;&#x542C;&#x8BF4;&#x4F60;&#x8840;&#x8109;&#x89C9;&#x9192;&#x5931;&#x8D25;&#xFF0C;&#x771F;&#x6C14;&#x53C8;&#x4E0D;&#x80FD;&#x51DD;&#x7EC3;&#xFF0C;&#x4E5F;&#x5B66;&#x522B;&#x4EBA;&#x6765;&#x4E70;&#x5175;&#x5668;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x60F3;&#x4E70;&#x4E00;&#x628A;&#x83DC;&#x5200;&#x56DE;&#x53BB;&#x6740;&#x9E21;&#x554A;&#xFF1F;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x9646;&#x9EBB;&#x5B50;&#xFF0C;&#x8BA9;&#x5F00;&#xFF0C;&#x4F60;&#x6321;&#x9053;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x4E0D;&#x6025;&#x4E0D;&#x7F13;&#x7684;&#x56DE;&#x4E86;&#x4E00;&#x53E5;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x9E23;&#xFF0C;&#x4F60;..&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x9646;&#x5175;&#x5E73;&#x751F;&#x6700;&#x8BA8;&#x538C;&#x522B;&#x4EBA;&#x53EB;&#x4ED6;&#x9EBB;&#x5B50;&#xFF0C;&#x73B0;&#x5728;&#x9646;&#x9E23;&#x5C45;&#x7136;&#x5F53;&#x7740;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x8F7B;&#x7F8E;&#x5973;&#x7684;&#x9762;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9646;&#x6885;&#x7684;&#x9762;&#x8FD9;&#x4E48;&#x53EB;&#x4ED6;&#xFF0C;&#x987F;&#x65F6;&#x8BA9;&#x4ED6;&#x706B;&#x5192;&#x4E09;&#x4E08;&#x3002;</p>
<p>  &#x201C;&#x738B;&#x9EBB;&#x5B50;&#xFF0C;&#x6211;&#x53EB;&#x4F60;&#x8BA9;&#x5F00;&#xFF01;&#x201D;&#x9646;&#x9E23;&#x51B7;&#x559D;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x627E;&#x6B7B;&#xFF0C;&#x4F60;&#x8FD8;&#x5F53;&#x4F60;&#x662F;&#x4E3B;&#x8109;&#x7684;&#x5C11;&#x7237;&#x5417;&#xFF1F;&#x7B49;&#x65CF;&#x4F1A;&#x4E00;&#x8FC7;&#xFF0C;&#x7476;&#x513F;&#x5C0F;&#x59D0;&#x767B;&#x4E0A;&#x5BB6;&#x4E3B;&#x4E4B;&#x4F4D;&#xFF0C;&#x4F60;&#x5C31;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#x4E86;&#xFF0C;&#x4F60;&#x660E;&#x767D;&#x5417;&#xFF1F;&#x4F60;&#x8FD8;&#x6562;&#x5F97;&#x7F6A;&#x6211;&#xFF1F;&#x5FEB;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x5FEB;&#x6765;&#x5DF4;&#x7ED3;&#x6211;&#xFF0C;&#x5411;&#x6211;&#x78D5;&#x5934;&#x9053;&#x6B49;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x80FD;&#x8D4F;&#x4F60;&#x4E00;&#x7897;&#x996D;&#x5403;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x5175;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x53EA;&#x88AB;&#x523A;&#x6FC0;&#x7684;&#x91CE;&#x72D7;&#x4E00;&#x6837;&#x53EB;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x4F46;&#x9646;&#x9E23;&#x5C31;&#x8FD9;&#x4E48;&#x51B7;&#x51B7;&#x7684;&#x770B;&#x7740;&#x4ED6;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x770B;&#x4E00;&#x4E2A;&#x767D;&#x75F4;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x7ED9;&#x6211;&#x7B49;&#x7740;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x5175;&#x773C;&#x4E2D;&#x95EA;&#x8FC7;&#x9634;&#x51B7;&#x4E4B;&#x8272;&#xFF0C;&#x6DF1;&#x5438;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x51B7;&#x9759;&#x4E0B;&#x6765;&#x3002;</p>
<p>  &#x968F;&#x673A;&#xFF0C;&#x5632;&#x8BBD;&#x7684;&#x770B;&#x7740;&#x9646;&#x9E23;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9646;&#x9E23;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x88AB;&#x6211;&#x8BF4;&#x4E2D;&#x4E86;&#xFF0C;&#x6765;&#x4E70;&#x83DC;&#x5200;&#x56DE;&#x53BB;&#x6740;&#x9E21;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#xFF0C;&#x51ED;&#x4F60;&#xFF0C;&#x80FD;&#x4E70;&#x7684;&#x8D77;&#x4EC0;&#x4E48;&#x597D;&#x4E1C;&#x897F;&#x5462;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x9646;&#x5175;&#x516C;&#x5B50;&#xFF0C;&#x6B22;&#x8FCE;&#x60A8;&#x5927;&#x9A7E;&#x5149;&#x4E34;&#x554A;&#xFF0C;&#x8BF7;&#x95EE;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x5C3D;&#x7BA1;&#x5F00;&#x53E3;&#x3002;&#x201D;</p>
<p>  &#x51E0;&#x4E2A;&#x5973;&#x5E97;&#x5458;&#x65E9;&#x5DF2;&#x7ECF;&#x56F4;&#x5728;&#x4E86;&#x9646;&#x5175;&#x8EAB;&#x524D;&#xFF0C;&#x8138;&#x4E0A;&#x6EE1;&#x662F;&#x8C04;&#x5A9A;&#x7684;&#x7B11;&#x8138;&#x3002;</p>
<p>  &#x201C;&#x563F;&#x563F;&#xFF01;&#x201D;</p>
<p>  &#x770B;&#x7740;&#x9646;&#x9E23;&#x8FB9;&#x4E0A;&#x5C31;&#x4E00;&#x4E2A;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x9646;&#x5175;&#x5F97;&#x610F;&#x7684;&#x51B7;&#x7B11;&#x4E00;&#x58F0;&#xFF0C;&#x6545;&#x610F;&#x5927;&#x58F0;&#x9053;&#xFF1A;&#x201C;&#x4ECA;&#x5929;&#x662F;&#x6211;&#x9646;&#x6885;&#x59B9;&#x59B9;&#x751F;&#x8FB0;&#xFF0C;&#x6211;&#x8981;&#x4E3A;&#x5979;&#x4E70;&#x4E00;&#x628A;&#x7075;&#x5175;&#x4F5C;&#x4E3A;&#x793C;&#x7269;&#xFF0C;&#x8BF4;&#x5427;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x7075;&#x5175;&#x63A8;&#x8350;&#x7684;&#x3002;&#x201D;</p>
<p>  &#x7279;&#x610F;&#x5C06;&#x2018;&#x7075;&#x5175;&#x2019;&#x4E24;&#x4E2A;&#x5B57;&#x54AC;&#x7684;&#x7279;&#x522B;&#x91CD;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x5175;&#x516C;&#x5B50;&#x8981;&#x4E70;&#x7075;&#x5175;&#x554A;&#xFF01;&#x201D;</p>
<p>  &#x90A3;&#x4E9B;&#x5973;&#x5E97;&#x5458;&#x987F;&#x65F6;&#x773C;&#x775B;&#x53D1;&#x4EAE;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x4F7F;&#x52B2;&#x7684;&#x63A8;&#x8350;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x5175;&#x516C;&#x5B50;&#x4F60;&#x770B;&#x8FD9;&#x628A;&#x9752;&#x677E;&#x5251;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x5185;&#x542B;&#x677E;&#x7EB9;...&#x201D;</p>
<p>  &#x201C;&#x8FD9;&#x628A;&#x94F6;&#x51B0;&#x5251;&#x4E5F;&#x5F88;&#x4E0D;&#x9519;...&#x201D;</p>
<p>  &#x4F46;&#x662F;&#x9646;&#x6885;&#x770B;&#x4E86;&#x770B;&#x90A3;&#x4E9B;&#x7075;&#x5175;&#x540E;&#xFF0C;&#x90FD;&#x662F;&#x6447;&#x5934;&#xFF0C;&#x663E;&#x7136;&#x662F;&#x770B;&#x4E0D;&#x4E0A;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x5175;&#x4E00;&#x54AC;&#x7259;&#xFF0C;&#x53EB;&#x9053;&#xFF1A;&#x201C;&#x522B;&#x62FF;&#x90A3;&#x4E9B;&#x4E00;&#x7EA7;&#x4E0B;&#x54C1;&#x7075;&#x5175;&#x6765;&#x7CCA;&#x5F04;&#x6211;&#xFF0C;&#x628A;&#x4F60;&#x4EEC;&#x7684;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#x62FF;&#x51FA;&#x6765;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x9646;&#x5175;&#x516C;&#x5B50;&#x4F60;&#x8981;&#x4E70;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#xFF1F;&#x201D;&#x90A3;&#x4E9B;&#x5973;&#x5E97;&#x5458;&#x4E00;&#x542C;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x773C;&#x775B;&#x76F4;&#x53D1;&#x5149;&#xFF0C;&#x6FC0;&#x52A8;&#x7684;&#x8EAB;&#x4F53;&#x53D1;&#x6296;&#xFF0C;&#x50CF;&#x6253;&#x4E86;&#x9E21;&#x8840;&#x4E00;&#x6837;&#x56F4;&#x7740;&#x9646;&#x5175;&#x63A8;&#x9500;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x4E00;&#x628A;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x4EF7;&#x503C;&#x81F3;&#x5C11;&#x4E5F;&#x662F;&#x516B;&#x767E;&#x4E24;&#x767D;&#x94F6;&#x4EE5;&#x4E0A;&#xFF0C;&#x5356;&#x51FA;&#x53BB;&#x4E86;&#x5979;&#x4EEC;&#x7684;&#x63D0;&#x6210;&#x4E5F;&#x7EDD;&#x5BF9;&#x4E0D;&#x5C11;&#x554A;&#xFF0C;&#x4E0D;&#x6FC0;&#x52A8;&#x624D;&#x602A;&#x5462;&#xFF1F;</p>
<p>  &#x9646;&#x9E23;&#x8FB9;&#x4E0A;&#xFF0C;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x4E00;&#x8138;&#x7FA1;&#x6155;&#x7684;&#x770B;&#x7740;&#xFF0C;&#x5979;&#x751F;&#x6027;&#x817C;&#x8146;&#xFF0C;&#x6839;&#x672C;&#x7ADE;&#x4E89;&#x4E0D;&#x8FC7;&#x5176;&#x4ED6;&#x90A3;&#x4E9B;&#x5E97;&#x5458;&#x3002;</p>
<p>  &#x7ECF;&#x8FC7;&#x4E00;&#x756A;&#x4F7F;&#x547D;&#x63A8;&#x8350;&#xFF0C;&#x9646;&#x5175;&#x9009;&#x4E86;&#x4E00;&#x628A;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x6E05;&#x98CE;&#x5251;&#x3002;</p>
<p>  &#x4EF7;&#x503C;&#x4E00;&#x5343;&#x4E24;&#x767D;&#x94F6;&#x3002;</p>
<p>  &#x9646;&#x5175;&#x6709;&#x4E9B;&#x8089;&#x75DB;&#x7684;&#x4ED8;&#x4E86;&#x94F6;&#x7968;&#xFF0C;&#x4E24;&#x5F20;&#x4E94;&#x767E;&#x4E24;&#x9762;&#x989D;&#x7684;&#x94F6;&#x7968;&#xFF0C;&#x8FD8;&#x6545;&#x610F;&#x62FF;&#x5728;&#x624B;&#x4E2D;&#x6643;&#x4E86;&#x6643;&#xFF0C;&#x770B;&#x4E86;&#x770B;&#x5510;&#x67AB;&#xFF0C;&#x4E00;&#x8138;&#x7684;&#x8F7B;&#x8511;&#x3002;</p>
<p>  &#x201C;&#x600E;&#x4E48;&#xFF1F;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x8FD8;&#x4E0D;&#x6311;&#x9009;&#x4F60;&#x8981;&#x4E70;&#x7684;&#x5175;&#x5668;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x5175;&#x5668;&#x592A;&#x4F4E;&#x7EA7;&#xFF0C;&#x4F60;&#x770B;&#x4E0D;&#x4E0A;&#x554A;&#xFF1F;&#x54C8;&#x54C8;&#x54C8;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x5175;&#x56A3;&#x5F20;&#x7684;&#x5927;&#x7B11;&#x3002;</p>
<p>  &#x201C;&#x90A3;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x9646;&#x5175;&#x54E5;&#x54E5;&#xFF0C;&#x4EBA;&#x5BB6;&#x53EF;&#x662F;&#x4E3B;&#x8109;&#x7684;&#x5927;&#x5C11;&#x7237;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x4F1A;&#x770B;&#x5F97;&#x4E0A;&#x8FD9;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#x5462;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x6885;&#x8F7B;&#x7B11;&#x9053;&#xFF0C;&#x62FF;&#x7740;&#x6E05;&#x98CE;&#x5251;&#xFF0C;&#x5DE6;&#x770B;&#x53F3;&#x770B;&#xFF0C;&#x7231;&#x4E0D;&#x91CA;&#x624B;&#x3002;</p>
<p>  &#x201C;&#x4F60;&#x4EEC;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x7684;&#xFF1F;&#x6211;&#x662F;&#x771F;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x7684;&#x5175;&#x5668;&#x592A;&#x4F4E;&#x7EA7;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x5FFD;&#x7136;&#xFF0C;&#x9646;&#x9E23;&#x6545;&#x4F5C;&#x8BE7;&#x5F02;&#x7684;&#x9053;&#x3002;</p>
<p>  &#x7136;&#x540E;&#x5BF9;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x9053;&#xFF1A;&#x201C;&#x59D1;&#x5A18;&#xFF0C;&#x4F60;&#x4EEC;&#x8FD9;&#x91CC;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#xFF1F;&#x62FF;&#x7ED9;&#x6211;&#x770B;&#x770B;&#x5427;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x5565;&#xFF1F;&#x201D;</p>
<p>  &#x5168;&#x573A;&#x731B;&#x7136;&#x4E00;&#x9759;&#xFF0C;&#x5305;&#x62EC;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x79CB;&#x6708;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x9646;&#x5175;&#xFF0C;&#x9646;&#x6885;&#x90FD;&#x6123;&#x6123;&#x7684;&#x770B;&#x7740;&#x9646;&#x9E23;&#x3002;</p>
<p>  &#x201C;&#x4EC0;&#x4E48;&#xFF1F;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x8981;&#x4E70;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#xFF1F;&#x4F60;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#x8981;&#x591A;&#x5C11;&#x91CF;&#x94F6;&#x5B50;&#xFF1F;&#x8FD9;&#x4E0D;&#x662F;&#x9760;&#x5634;&#x8BF4;&#x8BF4;&#x7684;&#xFF0C;&#x4F60;&#x4E70;&#x7684;&#x8D77;&#x5417;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x5175;&#x773C;&#x5149;&#x4E00;&#x95EA;&#xFF0C;&#x5BF9;&#x9646;&#x9E23;&#x53EB;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x4E00;&#x628A;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x4EF7;&#x683C;&#x8D77;&#x7801;&#x662F;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x7075;&#x5175;&#x7684;&#x597D;&#x51E0;&#x500D;&#xFF0C;&#x6253;&#x6B7B;&#x4ED6;&#x90FD;&#x4E0D;&#x4FE1;&#x9646;&#x9E23;&#x80FD;&#x4E70;&#x7684;&#x8D77;&#x3002;</p>
<p>  &#x201C;&#x516C;&#x5B50;&#xFF0C;&#x4F60;&#x662F;&#x8BF4;&#x4F60;&#x8981;&#x4E70;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#x5417;&#xFF1F;&#x201D;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x4E5F;&#x6709;&#x4E9B;&#x4E0D;&#x6562;&#x7F6E;&#x4FE1;&#x7684;&#x95EE;&#x3002;</p>
<p>  &#x201C;&#x600E;&#x4E48;&#xFF1F;&#x4F60;&#x4EEC;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#x5417;&#xFF1F;&#x8FD8;&#x662F;&#x6015;&#x6211;&#x5E26;&#x7684;&#x94F6;&#x4E24;&#x4E0D;&#x591F;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x7B11;&#x4E86;&#x7B11;&#xFF0C;&#x4ECE;&#x6000;&#x91CC;&#x62FF;&#x51FA;&#x4E00;&#x53E0;&#x94F6;&#x7968;&#xFF0C;&#x90FD;&#x662F;&#x4E94;&#x767E;&#x4E24;&#x9762;&#x989D;&#x4E00;&#x5F20;&#x7684;&#xFF0C;&#x8DB3;&#x8DB3;&#x6709;&#x5341;&#x51E0;&#x5F20;&#x3002;</p>
<p>  &#x201C;&#x4F60;...&#x4F60;&#x600E;&#x4E48;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x94F6;&#x7968;&#xFF1F;&#x201D;</p>
<p>  &#x770B;&#x7740;&#x9646;&#x9E23;&#x624B;&#x4E2D;&#x62FF;&#x7740;&#x7684;&#x4E00;&#x53E0;&#x94F6;&#x7968;&#xFF0C;&#x9646;&#x5175;&#x773C;&#x73E0;&#x5B50;&#x90FD;&#x5DEE;&#x70B9;&#x77AA;&#x51FA;&#x6765;&#x3002;</p>
<p>  &#x9646;&#x6885;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51E0;&#x4E2A;&#x5973;&#x5E97;&#x5458;&#x4E5F;&#x5DEE;&#x70B9;&#x628A;&#x773C;&#x73E0;&#x5B50;&#x77AA;&#x4E86;&#x51FA;&#x6765;&#x3002;</p>
<p>  &#x800C;&#x79CB;&#x6708;&#x4E5F;&#x5F20;&#x7740;&#x5C0F;&#x5634;&#xFF0C;&#x6123;&#x6123;&#x7684;&#x770B;&#x7740;&#x9646;&#x9E23;&#x3002;</p>
<p>  &#x201C;&#x770B;&#x6765;&#x5C11;&#x7237;&#x771F;&#x7684;&#x5F97;&#x5230;&#x5947;&#x9047;&#x4E86;&#x5462;&#xFF1F;&#x201D;&#x79CB;&#x6708;&#x5FC3;&#x91CC;&#x60F3;&#x5230;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; ly@cqkjuniversity.com 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-01-06 19:23:18
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="7.html" class="navigation navigation-prev " aria-label="Previous page: 第七章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="9.html" class="navigation navigation-next " aria-label="Next page: 第九章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第八章","level":"1.10","depth":1,"next":{"title":"第九章","level":"1.11","depth":1,"path":"9.md","ref":"9.md","articles":[]},"previous":{"title":"第七章","level":"1.9","depth":1,"path":"7.md","ref":"7.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","chapter-fold","code","splitter","-lunr","-search","search-pro","insert-logo","custom-favicon","pageview-count","tbfed-pagefooter","popup","-sharing","sharing-plus","donate","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy ly@cqkjuniversity.com 2021","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://i.loli.net/2021/01/06/AXCKm6Mp2oxFngb.png","wechatText":"微信"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"./icon/book.ico","back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 30px; min-height: 30px","url":"https://image.baidu.com/search/detail?ct=503316480&z=undefined&tn=baiduimagedetail&ipn=d&word=%E5%9B%BE%E7%89%87&step_word=&ie=utf-8&in=&cl=2&lm=-1&st=undefined&hd=undefined&latest=undefined&copyright=undefined&cs=2631334549,246605465&os=925726685,274215688&simid=4204922451,643817904&pn=59&rn=1&di=32230&ln=1566&fr=&fmq=1609933260618_R&fm=&ic=undefined&s=undefined&se=&sme=&tab=0&width=undefined&height=undefined&face=undefined&is=0,0&istype=0&ist=&jit=&bdtype=0&spn=0&pi=0&gsm=0&hs=2&objurl=https%3A%2F%2Fgimg2.baidu.com%2Fimage_search%2Fsrc%3Dhttp%253A%252F%252Fa4.att.hudong.com%252F52%252F35%252F01300000248079122537357453023.jpg%26refer%3Dhttp%253A%252F%252Fa4.att.hudong.com%26app%3D2002%26size%3Df9999%2C10000%26q%3Da80%26n%3D0%26g%3D0n%26fmt%3Djpeg%3Fsec%3D1612525262%26t%3D923b32ede80b565aa16a7dcf9153ebed&rpstart=0&rpnum=0&adpicid=0&force=undefined"}},"theme":"default","author":"liuyi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Linux大作业","language":"zh-hans","gitbook":"*","description":"666"},"file":{"path":"8.md","mtime":"2021-01-06T11:23:18.640Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-06T13:45:05.512Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

