
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章 · Linux大作业</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="liuyi">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10.html" />
    
    
    <link rel="prev" href="8.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第九章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;9&#x7AE0;-&#x53C8;&#x89C1;&#x7A46;&#x5170;">&#x7B2C;9&#x7AE0; &#x53C8;&#x89C1;&#x7A46;&#x5170;</h1>
<p>&#x800C;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x66F4;&#x662F;&#x6FC0;&#x52A8;&#x7684;&#x5706;&#x8138;&#x901A;&#x7EA2;&#xFF0C;&#x7ED3;&#x7ED3;&#x5DF4;&#x5DF4;&#x9053;&#xFF1A;&#x201C;&#x6709;..&#x6709;&#x7684;&#xFF0C;&#x6709;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#x7684;&#xFF0C;&#x60A8;&#x7A0D;&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x53BB;&#x7ED9;&#x60A8;&#x62FF;&#x3002;&#x201D;</p>
<p>  &#x8BF4;&#x5B8C;&#xFF0C;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x6025;&#x51B2;&#x51B2;&#x7684;&#x5411;&#x540E;&#x9762;&#x8DD1;&#x53BB;&#xFF0C;&#x4E00;&#x4F1A;&#xFF0C;&#x5C31;&#x770B;&#x5979;&#x548C;&#x51E0;&#x4E2A;&#x5927;&#x6C49;&#x5E26;&#x7740;&#x56DB;&#x4E94;&#x4EF6;&#x7075;&#x5175;&#x8D76;&#x4E86;&#x8FC7;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x516C;&#x5B50;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#xFF0C;&#x8BF7;&#x770B;&#xFF0C;&#x8FD9;&#x4E00;&#x628A;&#x540D;&#x4E3A;&#x79CB;&#x6C34;&#x5251;&#x3002;&#x201D;</p>
<p>  &#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x62FF;&#x8FC7;&#x4E00;&#x67C4;&#x957F;&#x5251;&#xFF0C;&#x4E00;&#x62BD;&#x51FA;&#xFF0C;&#x957F;&#x5251;&#x51FA;&#x9798;&#x3002;</p>
<p>  &#x5251;&#x957F;&#x4E00;&#x7C73;&#x4E94;&#xFF0C;&#x7565;&#x8584;&#xFF0C;&#x5251;&#x8EAB;&#x5982;&#x4E00;&#x6C6A;&#x6E05;&#x6CC9;&#x4E00;&#x822C;&#xFF0C;&#x5C45;&#x7136;&#x6563;&#x53D1;&#x51FA;&#x4E00;&#x5708;&#x5708;&#x7684;&#x6C34;&#x6C7D;&#x3002;</p>
<p>  &#x201C;&#x597D;&#x5251;&#xFF01;&#x201D;&#x9646;&#x9E23;&#x773C;&#x775B;&#x4E00;&#x4EAE;&#x3002;</p>
<p>  &#x4E0E;&#x8FD9;&#x628A;&#x5251;&#x4E00;&#x6BD4;&#xFF0C;&#x9646;&#x6885;&#x624B;&#x4E0A;&#x7684;&#x6E05;&#x98CE;&#x5251;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5783;&#x573E;&#x3002;</p>
<p>  &#x4E0D;&#x8FC7;&#x9646;&#x9E23;&#x8FD8;&#x662F;&#x6447;&#x4E86;&#x6447;&#x5934;&#xFF0C;&#x8FD9;&#x628A;&#x5251;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x4ED6;&#x7684;&#x529F;&#x6CD5;&#x4E0D;&#x7B26;&#xFF0C;&#x63A5;&#x7740;&#x770B;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x8FDE;&#x7EED;&#x770B;&#x4E86;&#x51E0;&#x628A;&#x3002;</p>
<p>  &#x94FF;&#xFF01;</p>
<p>  &#x6700;&#x540E;&#x4E00;&#x628A;&#xFF0C;&#x540D;&#x4E3A;&#x9ED1;&#x950B;&#x5251;&#xFF0C;&#x5251;&#x8EAB;&#x9EDD;&#x9ED1;&#xFF0C;&#x6563;&#x53D1;&#x7740;&#x8367;&#x5149;&#xFF0C;&#x5982;&#x9ED1;&#x7389;&#x94F8;&#x9020;&#x800C;&#x6210;&#xFF0C;&#x4E24;&#x4FA7;&#x5BD2;&#x5149;&#x95EA;&#x70C1;&#xFF0C;&#x5145;&#x6EE1;&#x4E86;&#x950B;&#x9510;&#x4E4B;&#x611F;&#x3002;</p>
<p>  &#x201C;&#x5C31;&#x8FD9;&#x628A;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x773C;&#x775B;&#x4E00;&#x4EAE;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x638C;&#x67DC;&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x628A;&#xFF0C;&#x591A;&#x5C11;&#x94F6;&#x5B50;&#xFF1F;&#x201D;</p>
<p>  &#x201C;&#x516C;&#x5B50;&#x771F;&#x662F;&#x597D;&#x773C;&#x529B;&#xFF0C;&#x8FD9;&#x4E00;&#x628A;&#x9ED1;&#x950B;&#x5251;&#xFF0C;&#x5728;&#x4E00;&#x7EA7;&#x4E0A;&#x54C1;&#x7075;&#x5175;&#x5F53;&#x4E2D;&#xFF0C;&#x90FD;&#x662F;&#x7CBE;&#x54C1;&#x554A;&#xFF0C;&#x4E5F;&#x4E0D;&#x7B97;&#x60A8;&#x8D35;&#xFF0C;&#x5C31;&#x7B97;&#x4E09;&#x5343;&#x4E24;&#x767D;&#x94F6;&#x597D;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x597D;&#xFF01;&#x201D;&#x9646;&#x9E23;&#x975E;&#x5E38;&#x723D;&#x5FEB;&#x7684;&#x62BD;&#x51FA;&#x516D;&#x5F20;&#x4E94;&#x767E;&#x4E24;&#x9762;&#x989D;&#x7684;&#x94F6;&#x7968;&#xFF0C;&#x9012;&#x7ED9;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x53CD;&#x6B63;&#x90FD;&#x662F;&#x4ECE;&#x6C99;&#x86C7;&#x76D7;&#x90A3;&#x91CC;&#x5F97;&#x6765;&#x7684;&#x94F6;&#x5B50;&#xFF0C;&#x9646;&#x9E23;&#x82B1;&#x8D77;&#x6765;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x5FC3;&#x75BC;&#x3002;</p>
<p>  &#x4E00;&#x65C1;&#xFF0C;&#x9646;&#x5175;&#x4E00;&#x8138;&#x7684;&#x9634;&#x6C89;&#xFF0C;&#x9646;&#x6885;&#x770B;&#x4E86;&#x624B;&#x4E2D;&#x7684;&#x6E05;&#x98CE;&#x5251;&#xFF0C;&#x53C8;&#x770B;&#x4E86;&#x770B;&#x9646;&#x9E23;&#x624B;&#x4E2D;&#x7684;&#x9ED1;&#x950B;&#x5251;&#xFF0C;&#x6EE1;&#x662F;&#x7FA1;&#x6155;&#x3002;</p>
<p>  &#x800C;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x66F4;&#x662F;&#x5174;&#x594B;&#x7684;&#x8138;&#x86CB;&#x901A;&#x7EA2;&#xFF0C;&#x4E09;&#x5343;&#x4E24;&#x767D;&#x94F6;&#x7684;&#x4EA4;&#x6613;&#x554A;&#xFF0C;&#x5979;&#x80FD;&#x62FF;&#x591A;&#x5C11;&#x7684;&#x63D0;&#x6210;&#xFF1F;</p>
<p>  &#x800C;&#x5176;&#x4ED6;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x7FA1;&#x6155;&#x65E0;&#x6BD4;&#x7684;&#x770B;&#x7740;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#xFF0C;&#x5FC3;&#x91CC;&#x90FD;&#x65E0;&#x6BD4;&#x540E;&#x6094;&#xFF0C;&#x8981;&#x662F;&#x65E9;&#x77E5;&#x9053;&#x9646;&#x9E23;&#x8FD9;&#x4E48;&#x6709;&#x94B1;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x8BA9;&#x5706;&#x8138;&#x5973;&#x5E97;&#x5458;&#x62A2;&#x4E86;&#x53BB;&#x3002;</p>
<p>  &#x7FA1;&#x6155;&#x5F52;&#x7FA1;&#x6155;&#xFF0C;&#x4F46;&#x5DF2;&#x7ECF;&#x665A;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x544A;&#x8BEB;&#x81EA;&#x5DF1;&#xFF0C;&#x4EE5;&#x540E;&#x51B3;&#x4E0D;&#x80FD;&#x4EE5;&#x8C8C;&#x53D6;&#x4EBA;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x62FF;&#x8D77;&#x9ED1;&#x950B;&#x5251;&#xFF0C;&#x4E00;&#x62C9;&#x79CB;&#x6708;&#x7684;&#x5C0F;&#x624B;&#xFF0C;&#x8D70;&#x5230;&#x9646;&#x5175;&#x8EAB;&#x8FB9;&#xFF0C;&#x770B;&#x4E86;&#x770B;&#x9646;&#x6885;&#x624B;&#x4E2D;&#x7684;&#x6E05;&#x98CE;&#x5251;&#xFF0C;&#x4F4E;&#x58F0;&#x9053;&#xFF1A;&#x201C;&#x8FD9;&#x4E48;&#x5783;&#x573E;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x4E5F;&#x770B;&#x5F97;&#x4E0A;&#xFF1F;&#x201D;</p>
<p>  &#x8BF4;&#x5B8C;&#xFF0C;&#x5927;&#x7B11;&#x51FA;&#x95E8;&#x800C;&#x53BB;&#x3002;</p>
<p>  &#x201C;&#x9646;&#x9E23;&#xFF01;&#x201D;</p>
<p>  &#x9646;&#x5175;&#x8138;&#x8272;&#x96BE;&#x770B;&#x7684;&#x8981;&#x6B7B;&#xFF0C;&#x7259;&#x9F7F;&#x54AC;&#x7684;&#x54AF;&#x54AF;&#x54CD;&#x3002;</p>
<p>  &#x201C;&#x5C11;&#x7237;&#xFF0C;&#x521A;&#x521A;&#x771F;&#x662F;&#x89E3;&#x6C14;&#x5462;&#xFF0C;&#x90A3;&#x4E2A;&#x9646;&#x5175;&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x4E2A;&#x9646;&#x6885;&#xFF0C;&#x4E00;&#x76F4;&#x72D7;&#x773C;&#x770B;&#x4EBA;&#x4F4E;&#xFF0C;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x81EA;&#x5DF1;&#x6253;&#x81EA;&#x5DF1;&#x8138;&#x4E86;&#x5427;&#x3002;&#x201D;</p>
<p>  &#x51FA;&#x4E86;&#x795E;&#x5175;&#x9601;&#xFF0C;&#x79CB;&#x6708;&#x6325;&#x821E;&#x7740;&#x5C0F;&#x62F3;&#x5934;&#xFF0C;&#x4E00;&#x8138;&#x5174;&#x594B;&#x7684;&#x9053;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x5FAE;&#x5FAE;&#x4E00;&#x7B11;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x9646;&#x5175;&#x4ED6;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x653E;&#x5728;&#x5FC3;&#x4E0A;&#xFF0C;&#x4ED6;&#x7684;&#x76EE;&#x6807;&#x662F;&#x9646;&#x7476;&#x3002;</p>
<p>  &#x8D70;&#x5728;&#x574A;&#x5E02;&#x4E4B;&#x4E2D;&#xFF0C;&#x79CB;&#x6708;&#x4E00;&#x53CC;&#x5927;&#x773C;&#x77AA;&#x7684;&#x8001;&#x5927;&#xFF0C;&#x4E1C;&#x5F20;&#x897F;&#x671B;&#x7684;&#x3002;</p>
<p>  &#x574A;&#x5E02;&#x4E4B;&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#x666E;&#x904D;&#x504F;&#x8D35;&#xFF0C;&#x79CB;&#x6708;&#x8FD9;&#x4E9B;&#x5E74;&#x8FD8;&#x6CA1;&#x6765;&#x8FC7;&#x51E0;&#x6B21;&#x5462;&#xFF0C;&#x81EA;&#x7136;&#x597D;&#x5947;&#x7684;&#x5F88;&#x3002;</p>
<p>  &#x9646;&#x9E23;&#x4E5F;&#x966A;&#x7740;&#x79CB;&#x6708;&#x901B;&#x4E86;&#x4E00;&#x4F1A;&#xFF0C;&#x7136;&#x540E;&#x62FF;&#x51FA;&#x4E24;&#x767E;&#x4E24;&#x7684;&#x94F6;&#x7968;&#x4EA4;&#x7ED9;&#x79CB;&#x6708;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x79CB;&#x6708;&#xFF0C;&#x4F60;&#x62FF;&#x7740;&#x94F6;&#x5B50;&#x53BB;&#x4E70;&#x4E00;&#x4E9B;&#x5403;&#x7684;&#x7528;&#x7684;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x4E8B;&#xFF0C;&#x4F60;&#x4E70;&#x597D;&#x4E86;&#x5728;&#x8FD9;&#x91CC;&#x7B49;&#x6211;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x5C11;&#x7237;&#xFF0C;&#x90A3;&#x8981;&#x662F;&#x592B;&#x4EBA;&#x95EE;&#x8D77;&#x94F6;&#x5B50;&#x54EA;&#x91CC;&#x6765;&#x7684;&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF1F;&#x201D;&#x79CB;&#x6708;&#x95EE;&#x3002;</p>
<p>  &#x201C;&#x6069;&#xFF0C;&#x5C31;&#x544A;&#x8BC9;&#x5A18;&#xFF0C;&#x8BF4;&#x6211;&#x5728;&#x5996;&#x517D;&#x5C71;&#x8109;&#x5916;&#x56F4;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x682A;&#x7075;&#x8349;&#xFF0C;&#x8D5A;&#x4E86;&#x4E00;&#x4E9B;&#x94F6;&#x5B50;&#x3002;&#x201D;&#x5510;&#x67AB;&#x7565;&#x4E00;&#x601D;&#x7D22;&#x9053;&#x3002;</p>
<p>  &#x79CB;&#x6708;&#x70B9;&#x5934;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x90A3;&#x597D;&#xFF0C;&#x90A3;&#x5C11;&#x7237;&#x6211;&#x53BB;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x79CB;&#x6708;&#x62FF;&#x7740;&#x94F6;&#x5B50;&#xFF0C;&#x6B22;&#x559C;&#x7684;&#x8DD1;&#x53BB;&#x901B;&#x8857;&#x4E86;&#x3002;</p>
<p>  &#x968F;&#x540E;&#xFF0C;&#x9646;&#x9E23;&#x627E;&#x4E86;&#x4E2A;&#x6CA1;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6362;&#x4E0A;&#x4E86;&#x9ED1;&#x888D;&#x6597;&#x7B20;&#xFF0C;&#x53C8;&#x4E00;&#x6B21;&#x6765;&#x5230;&#x7075;&#x836F;&#x5802;&#x3002;</p>
<p>  &#x4ED6;&#x6253;&#x7B97;&#x518D;&#x8D2D;&#x4E70;&#x4E00;&#x6279;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x518D;&#x4E70;&#x4E00;&#x4E9B;&#x8865;&#x8840;&#x4E39;&#x7ED9;&#x79CB;&#x6708;&#x7528;&#x3002;</p>
<p>  &#x63A5;&#x5F85;&#x4ED6;&#x7684;&#xFF0C;&#x4F9D;&#x7136;&#x662F;&#x7A46;&#x5170;&#x3002;</p>
<p>  &#x4ECA;&#x65E5;&#xFF0C;&#x7A46;&#x5170;&#x6362;&#x4E86;&#x4E00;&#x8EAB;&#x9ED1;&#x8272;&#x7684;&#x7D27;&#x8EAB;&#x7EB1;&#x88D9;&#xFF0C;&#x66F4;&#x663E;&#x7684;&#x8BF1;&#x60D1;&#x3002;</p>
<p>  &#x66F2;&#x7EBF;&#x51F9;&#x51F8;&#x8D77;&#x4F0F;&#xFF0C;&#x767D;&#x7699;&#x7684;&#x808C;&#x80A4;&#x5728;&#x9ED1;&#x8272;&#x7EB1;&#x88D9;&#x4E0B;&#x82E5;&#x9690;&#x82E5;&#x73B0;&#xFF0C;&#x8BA9;&#x4EBA;&#x6068;&#x4E0D;&#x5F97;&#x60F3;&#x8981;&#x6495;&#x5F00;&#x90A3;&#x9ED1;&#x8272;&#x7684;&#x7EB1;&#x88D9;&#xFF0C;&#x4E00;&#x63A2;&#x7A76;&#x7ADF;&#x3002;</p>
<p>  &#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x4F60;&#x53C8;&#x6765;&#x4E86;&#xFF1F;&#x201D;</p>
<p>  &#x4E00;&#x89C1;&#x5230;&#x9646;&#x9E23;&#xFF0C;&#x7A46;&#x5170;&#x5C31;&#x5A07;&#x7B11;&#x7684;&#x5F00;&#x53E3;&#x3002;</p>
<p>  &#x201C;&#x6211;&#x8FD8;&#x6CA1;&#x5F00;&#x53E3;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x662F;&#x6211;&#xFF1F;&#x201D;&#x9646;&#x9E23;&#x538B;&#x4F4E;&#x58F0;&#x97F3;&#x9053;&#x3002;</p>
<p>  &#x7A46;&#x5170;&#x2018;&#x54AF;&#x54AF;&#x2019;&#x5A07;&#x7B11;&#xFF0C;&#x80F8;&#x524D;&#x7684;&#x575A;&#x633A;&#x4E00;&#x9635;&#x8D77;&#x4F0F;&#xFF0C;&#x83B2;&#x6B65;&#x8F7B;&#x62AC;&#xFF0C;&#x9760;&#x8FD1;&#x9646;&#x9E23;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x56E0;&#x4E3A;&#x4F60;&#x8EAB;&#x4E0A;&#x7684;&#x6C14;&#x5473;&#x554A;&#xFF0C;&#x4EBA;&#x5BB6;&#x53EF;&#x662F;&#x80FD;&#x95FB;&#x51FA;&#x4F60;&#x7684;&#x6C14;&#x5473;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x8BF4;&#x7740;&#xFF0C;&#x5C0F;&#x5DE7;&#x7CBE;&#x81F4;&#x7684;&#x9F3B;&#x5B50;&#x8FD8;&#x5728;&#x9646;&#x9E23;&#x8EAB;&#x65C1;&#x55C5;&#x4E86;&#x55C5;&#x3002;</p>
<p>  &#x5982;&#x5170;&#x82B1;&#x822C;&#x7684;&#x9999;&#x5473;&#x76F4;&#x5F80;&#x9646;&#x9E23;&#x9F3B;&#x5B50;&#x94BB;&#xFF0C;&#x9646;&#x9E23;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5341;&#x4E94;&#x5C81;&#x8840;&#x6C14;&#x65B9;&#x521A;&#x7684;&#x5C11;&#x5E74;&#xFF0C;&#x54EA;&#x91CC;&#x7ECF;&#x53D7;&#x7684;&#x4F4F;&#x8FD9;&#x7B49;&#x9635;&#x4ED7;&#xFF0C;&#x5FC3;&#x987F;&#x65F6;&#x6251;&#x901A;&#x6251;&#x901A;&#x7684;&#x4E71;&#x8DF3;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x201C;&#x7A46;&#x5802;&#x4E3B;&#xFF0C;&#x6211;&#x4ECA;&#x5929;&#x6765;&#xFF0C;&#x662F;&#x8D2D;&#x4E70;&#x9F99;&#x864E;&#x4E39;&#x7684;&#x3002;&#x201D;&#x9646;&#x9E23;&#x52C9;&#x5F3A;&#x6536;&#x655B;&#x5FC3;&#x795E;&#x9053;&#x3002;</p>
<p>  &#x7A46;&#x5170;&#x767D;&#x4E86;&#x4E00;&#x773C;&#x9646;&#x9E23;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x4F60;&#x6025;&#x4EC0;&#x4E48;&#x554A;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x4E0D;&#x60F3;&#x770B;&#x5230;&#x4EBA;&#x5BB6;&#x554A;&#xFF01;&#x201D;</p>
<p>  &#x201C;&#x4E0D;&#x662F;&#xFF0C;&#x7A46;&#x5802;&#x4E3B;&#x4F60;&#x8BEF;&#x4F1A;&#x4E86;&#xFF0C;&#x6211;&#x662F;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x8981;&#x529E;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x8FDE;&#x5FD9;&#x6325;&#x624B;&#xFF0C;&#x4ED6;&#x771F;&#x7684;&#x60F3;&#x8D76;&#x7D27;&#x79BB;&#x5F00;&#x8FD9;&#x91CC;&#xFF0C;&#x7A46;&#x5170;&#x8FD9;&#x79CD;&#x5C24;&#x7269;&#xFF0C;&#x4EFB;&#x4F55;&#x7537;&#x4EBA;&#x90FD;&#x5403;&#x4E0D;&#x6D88;&#x3002;</p>
<p>  &#x201C;&#x54AF;&#x54AF;&#xFF0C;&#x90A3;&#x597D;&#x5427;&#xFF0C;&#x4F60;&#x8981;&#x4E70;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x201D;</p>
<p>  &#x7A46;&#x5170;&#x5A07;&#x7B11;&#x95EE;&#x3002;</p>
<p>  &#x201C;&#x4E00;&#x767E;&#x4E8C;&#x5341;&#x9897;&#x4E00;&#x9636;&#x4E2D;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4E09;&#x5341;&#x9897;&#x8865;&#x8840;&#x4E39;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x4E48;&#x591A;&#xFF1F;&#x201D;</p>
<p>  &#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x7A46;&#x5170;&#x548C;&#x4F8D;&#x5973;&#x9F50;&#x9F50;&#x5927;&#x5403;&#x4E00;&#x60CA;&#x3002;</p>
<p>  &#x201C;&#x600E;&#x4E48;&#xFF1F;&#x7A46;&#x5802;&#x4E3B;&#xFF0C;&#x7075;&#x836F;&#x5802;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5417;&#xFF1F;&#x201D;&#x9646;&#x9E23;&#x7709;&#x5934;&#x8F7B;&#x8F7B;&#x4E00;&#x76B1;&#x3002;</p>
<p>  &#x540E;&#x9762;&#x4E24;&#x6761;&#x795E;&#x8109;&#xFF0C;&#x80AF;&#x5B9A;&#x66F4;&#x96BE;&#x6253;&#x901A;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x8981;&#x591A;&#x4E70;&#x4E00;&#x70B9;&#x3002;</p>
<p>  &#x7A46;&#x5170;&#x6DF1;&#x6DF1;&#x7684;&#x770B;&#x4E86;&#x9646;&#x9E23;&#x4E00;&#x773C;&#xFF0C;&#x91CD;&#x65B0;&#x9732;&#x51FA;&#x4E86;&#x7B11;&#x5BB9;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x6709;&#xFF0C;&#x5F53;&#x7136;&#x6709;&#xFF0C;&#x5C0F;&#x53F6;&#xFF0C;&#x53BB;&#x51C6;&#x5907;&#x4E39;&#x836F;&#x3002;&#x201D;</p>
<p>  &#x5C0F;&#x53F6;&#x70B9;&#x5934;&#x51FA;&#x53BB;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x4E45;&#xFF0C;&#x5C0F;&#x53F6;&#x4FBF;&#x7AEF;&#x7740;&#x51E0;&#x4E2A;&#x76D2;&#x5B50;&#x8FDB;&#x6765;&#x4E86;&#x3002;</p>
<p>  &#x4E00;&#x767E;&#x4E8C;&#x5341;&#x9897;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x4E09;&#x5341;&#x9897;&#x8865;&#x8840;&#x4E39;&#x3002;</p>
<p>  &#x7A46;&#x5170;&#x9053;&#xFF1A;&#x201C;&#x5BA2;&#x5B98;&#xFF0C;&#x4E00;&#x767E;&#x4E8C;&#x5341;&#x9897;&#x4E00;&#x7EA7;&#x4E2D;&#x54C1;&#x9F99;&#x864E;&#x4E39;&#xFF0C;&#x6253;&#x5B8C;&#x4E5D;&#x6298;&#x540E;&#xFF0C;&#x4E00;&#x5171;&#x662F;&#x4E09;&#x4E07;&#x4E24;&#x5343;&#x56DB;&#x767E;&#x91CF;&#xFF0C;&#x5C31;&#x7B97;&#x4E09;&#x4E07;&#x4E24;&#x5343;&#x4E24;&#x5427;&#xFF0C;&#x8FD8;&#x6709;&#xFF0C;&#x90A3;&#x4E09;&#x5341;&#x9897;&#x8865;&#x8840;&#x4E39;&#xFF0C;&#x5C31;&#x7B97;&#x6211;&#x9001;&#x7ED9;&#x5BA2;&#x5B98;&#x7684;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x90A3;&#x591A;&#x8C22;&#x7A46;&#x5802;&#x4E3B;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x63A5;&#x8FC7;&#x4E39;&#x836F;&#xFF0C;&#x4ED8;&#x4E86;&#x94F6;&#x5B50;&#xFF0C;&#x4E00;&#x62B1;&#x62F3;&#xFF0C;&#x5C31;&#x6025;&#x5FD9;&#x7684;&#x79BB;&#x5F00;&#x4E86;&#x7075;&#x836F;&#x5802;&#x4E86;&#x3002;</p>
<p>  &#x201C;&#x5C0F;&#x59D0;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x771F;&#x7684;&#x5F88;&#x6709;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x8FD9;&#x624D;&#x5341;&#x51E0;&#x5929;&#x554A;&#xFF0C;&#x4ED6;&#x4E0A;&#x6B21;&#x4E70;&#x7684;&#x9F99;&#x864E;&#x4E39;&#x96BE;&#x9053;&#x5C31;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x96BE;&#x9053;&#x4ED6;&#x4E70;&#x56DE;&#x53BB;&#x662F;&#x597D;&#x591A;&#x4EBA;&#x4E00;&#x8D77;&#x7528;&#x7684;&#x4E0D;&#x6210;&#xFF1F;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x8D70;&#x540E;&#xFF0C;&#x4F8D;&#x5973;&#x5C0F;&#x53F6;&#x597D;&#x5947;&#x7684;&#x9053;&#x3002;</p>
<p>  &#x201C;&#x4E0D;&#x597D;&#x8BF4;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x611F;&#x89C9;&#x4ED6;&#x6BD4;&#x4E0A;&#x6B21;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6C14;&#x606F;&#x5F3A;&#x4E86;&#x4E00;&#x5927;&#x622A;&#xFF0C;&#x7684;&#x786E;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x91CC;&#x770B;&#x7740;&#xFF0C;&#x6211;&#x8981;&#x53BB;&#x4EB2;&#x81EA;&#x770B;&#x770B;&#xFF0C;&#x770B;&#x770B;&#x5230;&#x5E95;&#x662F;&#x98CE;&#x706B;&#x57CE;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x9752;&#x5E74;&#x624D;&#x4FCA;&#xFF1F;&#x201D;</p>
<p>  &#x7A46;&#x5170;&#x5429;&#x5490;&#x4E86;&#x4E00;&#x58F0;&#xFF0C;&#x8EAB;&#x5F62;&#x4E00;&#x626D;&#xFF0C;&#x5982;&#x4E00;&#x9635;&#x98CE;&#x4E00;&#x822C;&#xFF0C;&#x5530;&#x7684;&#x4E00;&#x58F0;&#x5C31;&#x4E0D;&#x89C1;&#x4E86;&#x3002;</p>
<p>  ......</p>
<p>  &#x51FA;&#x4E86;&#x7075;&#x836F;&#x5802;&#xFF0C;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x6CA1;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9646;&#x9E23;&#x8131;&#x4E0B;&#x4E86;&#x9ED1;&#x888D;&#x6597;&#x7B20;&#xFF0C;&#x548C;&#x4E39;&#x836F;&#x4E00;&#x8D77;&#xFF0C;&#x6536;&#x8FDB;&#x4E86;&#x81F3;&#x5C0A;&#x795E;&#x6BBF;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E0E;&#x79CB;&#x6708;&#x7EA6;&#x5B9A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x627E;&#x5230;&#x4E86;&#x79CB;&#x6708;&#xFF0C;&#x548C;&#x79CB;&#x6708;&#x4E00;&#x8D77;&#x5F80;&#x56DE;&#x800C;&#x53BB;&#x3002;</p>
<p>  &#x4F46;&#x662F;&#x5728;&#x56DE;&#x53BB;&#x9646;&#x5BB6;&#x7684;&#x4E00;&#x6761;&#x6CA1;&#x4EBA;&#x7684;&#x5DF7;&#x5B50;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x88AB;&#x9646;&#x5175;&#x5E26;&#x7740;&#x4E24;&#x4E2A;&#x4EBA;&#x62E6;&#x4F4F;&#x4E86;&#x3002;</p>
<p>  &#x9646;&#x5175;&#x8138;&#x8272;&#x9634;&#x6C89;&#xFF0C;&#x76EF;&#x7740;&#x9646;&#x9E23;&#x9053;&#xFF1A;&#x201C;&#x9646;&#x9E23;&#xFF0C;&#x7EC8;&#x4E8E;&#x820D;&#x5F97;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x53EF;&#x7B49;&#x4E86;&#x597D;&#x4E45;&#x4E86;&#x3002;&#x201D;</p>
<p>  &#x201C;&#x4F60;...&#x4F60;&#x4EEC;&#x60F3;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x79CB;&#x6708;&#x4E0B;&#x610F;&#x8BC6;&#x7684;&#x62A4;&#x5728;&#x9646;&#x9E23;&#x8EAB;&#x524D;&#x3002;</p>
<p>  &#x9646;&#x5175;&#x53D1;&#x51FA;&#x4E00;&#x58F0;&#x51B7;&#x7B11;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x9646;&#x9E23;&#xFF0C;&#x4F60;&#x8FD9;&#x4E2A;&#x5E9F;&#x7269;&#xFF0C;&#x5C45;&#x7136;&#x6562;&#x5728;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x7684;&#x9762;&#x524D;&#x62C6;&#x6211;&#x7684;&#x62AC;&#xFF1F;&#x771F;&#x662F;&#x4E0D;&#x77E5;&#x6B7B;&#x6D3B;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#xFF0C;&#x628A;&#x4F60;&#x8EAB;&#x4E0A;&#x7684;&#x94F6;&#x5B50;&#x90FD;&#x4EA4;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9646;&#x5BB6;&#x5927;&#x95E8;&#x524D;&#xFF0C;&#x8DEA;&#x4E0B;&#x6765;&#x5927;&#x53EB;&#x4E09;&#x58F0;&#x2018;&#x6211;&#x662F;&#x5E9F;&#x7269;&#x2019;&#xFF0C;&#x6211;&#x5C31;&#x9976;&#x4E86;&#x4F60;&#x3002;&#x201D;</p>
<p>  &#x9646;&#x9E23;&#x6DE1;&#x6DE1;&#x4E00;&#x7B11;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x4F60;&#x7684;&#x786E;&#x662F;&#x4E2A;&#x5E9F;&#x7269;&#x3002;&#x201D; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; ly@cqkjuniversity.com 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-01-06 19:23:38
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="8.html" class="navigation navigation-prev " aria-label="Previous page: 第八章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10.html" class="navigation navigation-next " aria-label="Next page: 第十章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章","level":"1.11","depth":1,"next":{"title":"第十章","level":"1.12","depth":1,"path":"10.md","ref":"10.md","articles":[]},"previous":{"title":"第八章","level":"1.10","depth":1,"path":"8.md","ref":"8.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","chapter-fold","code","splitter","-lunr","-search","search-pro","insert-logo","custom-favicon","pageview-count","tbfed-pagefooter","popup","-sharing","sharing-plus","donate","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy ly@cqkjuniversity.com 2021","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://i.loli.net/2021/01/06/AXCKm6Mp2oxFngb.png","wechatText":"微信"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"./icon/book.ico","back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 30px; min-height: 30px","url":"https://image.baidu.com/search/detail?ct=503316480&z=undefined&tn=baiduimagedetail&ipn=d&word=%E5%9B%BE%E7%89%87&step_word=&ie=utf-8&in=&cl=2&lm=-1&st=undefined&hd=undefined&latest=undefined&copyright=undefined&cs=2631334549,246605465&os=925726685,274215688&simid=4204922451,643817904&pn=59&rn=1&di=32230&ln=1566&fr=&fmq=1609933260618_R&fm=&ic=undefined&s=undefined&se=&sme=&tab=0&width=undefined&height=undefined&face=undefined&is=0,0&istype=0&ist=&jit=&bdtype=0&spn=0&pi=0&gsm=0&hs=2&objurl=https%3A%2F%2Fgimg2.baidu.com%2Fimage_search%2Fsrc%3Dhttp%253A%252F%252Fa4.att.hudong.com%252F52%252F35%252F01300000248079122537357453023.jpg%26refer%3Dhttp%253A%252F%252Fa4.att.hudong.com%26app%3D2002%26size%3Df9999%2C10000%26q%3Da80%26n%3D0%26g%3D0n%26fmt%3Djpeg%3Fsec%3D1612525262%26t%3D923b32ede80b565aa16a7dcf9153ebed&rpstart=0&rpnum=0&adpicid=0&force=undefined"}},"theme":"default","author":"liuyi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Linux大作业","language":"zh-hans","gitbook":"*","description":"666"},"file":{"path":"9.md","mtime":"2021-01-06T11:23:38.315Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-06T13:45:05.512Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

